[
    {
        "date": "2014-08-12",
        "rating": "4.0",
        "review": "- The ambiance is dim (I got hit with the restroom door LOL... so walk against the wall okay?), upbeat, lively and cool.- I went on a Monday night around 11 and it was still pretty busy!- Each hot dog comes with 2 free toppings (sweet peppers, onions, jalapenos, sauerkraut  and many more :D)- The price is reasonable and I definitely think you should just go to this place at least once in your life :) - Water is self serve .. cool :D.- At first I was scared to eat the rattlesnake and rabbit hot dog because of the name and \"exotic meat\" but it was actually pretty tasty, kinda peppery.- The fries are great, steak fries and super crispy!- They have a few delicious sauces (honey mustard, grain, special ketchup.. etc.) on every table that you can use and slather on your hot dog!"
    },
    {
        "date": "2015-06-05",
        "rating": "5.0",
        "review": "A young clerk at our hotel recommended this restaurant. We were not disappointed. The line out the door moves fast and someone comes out to pass out menus and answer questions. Once inside, he took drink orders. My friend loved the rattlesnake & rabbit, and I really enjoyed the Filipino Marlika. We sat outside and enjoyed watching the people walking around. Very good beer selection. Excellent service. We would definitely go back. We felt like older hipsters."
    },
    {
        "date": "2015-06-16",
        "rating": "5.0",
        "review": "Wurstkuche is always a crowd favorite with delicious authentic sausages and such an impressive variety of beers. The set up is perfect for a date night or group of friends. It is an easy service place with a counter that you order at and can easily pay separately with large groups. The arts district of LA is an up and coming area with Angel City brewery directly across the street to continue a fun night out! Definitely get the fries with dipping sauces and be adventurous with different types of sausages!"
    },
    {
        "date": "2014-08-02",
        "rating": "3.0",
        "review": "The few other times I have been here, I had to wait in a line that hugged the exterior wall for at least 20 feet. Sometimes you'll get lucky and beat the crowd. _what I ordered:- Santa Fe: A little blah and dry. I probably won't be getting this one again.- Filipino: Nice and juicy. It actually tastes like a gourmet sausage (like the staff often advertises)- Fries: Their fries are great, especially with the chipotle mayo!They don't have a full bar but their beer selection is great! AND they do have a gluten-free beer if that's your thing!- Spaten Optimator: I usually like porters and dark beers so this obviously seemed appropriate. Doppelbock! Sehr Gut!In a nutshell: I still need to try the other \"gourmet\" sausages and their selection of imported beers is delightful._service/atmosphere:The main dining space is very dimly lit and has a nice intermingling atmosphere. Although most parties keep to themselves, there is that opportunity to talk to a stranger! That's all I ask for. _parking:Parking is tough here. You kind of have to just get lucky; just don't be up all night.At the moment I rate this place an \"A-OK\" and feel that it's a bit overrated. Expect to see the \"_what I ordered\" list to grow larger since they have a variety of different sausages and endless combinations with the additional 2 toppings."
    },
    {
        "date": "2015-05-21",
        "rating": "5.0",
        "review": "This is the best place ever!  Great to meet up with friends. Great to take your parents when they're in town - then go across the street and play video games with your dad.  And go get a piece of pie across the street too. If you can snag a table outside - that's your Sunday afternoon. Heaven."
    },
    {
        "date": "2013-08-12",
        "rating": "5.0",
        "review": "Great customer service. I didn't get a receipt when I first paid, and the girl said she'd send it to me with my food order. When I didn't get it, I told the guy who dropped off the food, who immediately went to look into it. While he was gone, a manager came by and dropped off my receipt, and then he came back to make sure that somebody had dropped it off. Everyone wanted to make sure that I'd gotten my receipt, which I really, really appreciated! My friend and I tried the Kielbasa (soooo good), the Vegetarian Italian Sausage (very good) and the Mango Jalapeno (only good if you like mango). We also got the belgian fries with curry ketchup (soooo good) and chipotle ketchup (good). This is a staple place that I will always want to take a friend if they've never been before. Also, it's cheap. AND, they have two sour beers.Sour beers are great if you like kombucha. I love kombucha. Sour beers + hot dogs and friends = bliss!"
    },
    {
        "date": "2014-09-03",
        "rating": "4.0",
        "review": "Finally found the sausage that helps me \"get\" the sausages. Filipino Pork Sausage is where it's at (insert suggestive references to Filipino hubby here). And the Koestrizer Schwarzbier is still a great deal. I got out for under $15. Parking on the street can be tricky, but drive around a bit and you'll find something. Arrive before 11:30 for no lines. Fave place to visit with mi amigo!"
    },
    {
        "date": "2013-11-14",
        "rating": "3.0",
        "review": "I've been here once and it was a good time. The sausages were good and the vibe is great BUT I don't see why it's AMAAAZING!Parking is a little hard to find during peak time. The line is long but it can go fairly quickly. I got the buffalo but I must say, if you are excited about trying exotic meats, you shouldn't eat it in sausage form. It's hard to get the true taste and texture of the meat. I got a sausage, small fries and a beer for almost $20. A little high for my taste.When we went to go sit down, it's a little awkward when it's crowded and you squeeze your way onto the bench at the communal table. For a little while, we were standing, just trying to figure out where to sit.Overall, the food was decent and it's great to go with a group of friends. Not a place for you if you want to go to a quiet, intimate spot. I'd come here again if a friend wanted to check it out, but I'm not dyyyying to go again.For dessert, you should definitely head over to Pie Hole across the street."
    },
    {
        "date": "2014-10-19",
        "rating": "4.0",
        "review": "I love this place and love to take newbies here. Ww had a 20+ minute wait in line on Saturday night aroud 8:30pm, but that's to be expected. It was a treat that they were  serving samples to the line, which only  made the anticipation for a full sausage that much more intense.I ordered the Mango Jalapeño and Kielbasa amd shared a large fries with a friend. Topped it off with a Hefe. Delicious!The food took just a few minutes to get to the table. The dj was good and the vibe was cool. It's a bit loud in the dining area...I had to yell across the table to have a conversation with my friend, but I that's  what happens when you put 200 people in a room and a dj.Overall, the food was delish, the wait was long, but good night."
    },
    {
        "date": "2014-08-14",
        "rating": "4.0",
        "review": "I hadn't been here in a couple years and was jonesing to go back.   So I headed down there with a friend and really enjoyed myself.Everything I remembered from my first trip was pretty much re-confirmed.  Excellent beer selections, exotic sausage choices, delicious dipping sauces, and hipstery/bohemian vibe.The indoor has a German beer hall feel to it, and can be a bit loud and rowdy, but the outdoor seating (open till 11) provides some fresh air and a more intimate setting.  I highly recommend Wurstküche for some delicious casual eats, and beer-snob-approved brews."
    },
    {
        "date": "2015-02-23",
        "rating": "4.0",
        "review": "The staff is really friendly and take care of you in line once you enter the door. We had a curly blond lady help us out so much. She answered all of our questions and explained all the item on the menu. She did this with everyone in line so thanks. My friend ordered the lamb with mediterranean spices,  I ordered my son the Bockwurst and for myself I ordered the pheasant with herbs de Provence with a side of groot fries with the chipotle ketchup and ranch dipping sauce.  All were delicious but my friend and I agreed that the lamb and Bockwurst were the best. I still enjoyed my pheasant as it's no ordinary hotdog. Ps. I hate hotdogs but I really wanted to try this place out. I ordered the lamb, hot Italian, sun dried tomato and Louisiana hot Link raw to go so I can try them later at home (looking forward to tasting them). So yeah this place is not cheap and the meats are quality so expect to pay some $. Oh! I'm not a bear drinker but I did have some if that cucumber infused water while waiting in line and it was so refreshing."
    },
    {
        "date": "2014-08-05",
        "rating": "4.0",
        "review": "It's a beer hall, and you can get sausages at the back. I'm serious. If you enter from 3rd Street, you won't see the counter to order food. It's just drinks from the bar, lots of communal bench seating and lots of hipsters. No one greeted us, no one acknowledged us for a while. Some kind stranger decided to help us out and point us into the back corner that leads into another area for food. When we did discover the food, it was nothing short of glorious. For $6 to $8 you get a sausage on bun with two toppings. Fries come in small and large, you get one or two dipping sauces depending on size. That's it. Simple and straight forward.We got the Mango Jalapeno and Duck Bacon to share, fries with curry ketchup and chipotle aoili dipping sauces. Each of the sausages have their own distinct texture and flavor. The mango jalapeno wasn't too spicy but had a kick, really juicy. The duck bacon wasn't so juicy, and was on the dry side. I think the real distinction is the dipping sauce for the fries. Delicious! I put that sh*t on everything! Even my sausage dogs! The fries on it's own are pretty blah but it made for a good sauce scooper. There's a good selection of unique sodas here too, like cucumber and elderflower. The Mr. Q cucumber soda is really refreshing, worth a try!"
    },
    {
        "date": "2014-08-08",
        "rating": "5.0",
        "review": "I have to say that this place really surprised me. The food here was DELICIOUS.Being a vegetarian for majority of my life, I have to admit that I was pretty apprehensive and hesitant about trying this place when my boyfriend recommended it. I mean, it's a sausage restaurant. What could I possibly order and actually enjoy that's vegetarian friendly at a restaurant that primarily sells sausages?Upon our arrival, an employee approached us and handed us coupons for free Klein fries with one dipping sauce since they had ran out of buns. Well, that seemed strange, but we still wanted to have dinner here so we accepted the coupons and ordered our meal. I had the Vegetarian Italian with caramelized onions and spicy peppers, and fries with the Chipotle Aioli, while my boyfriend opted for the Bratwurst with caramelized onions and spicy peppers with fries and the Sweet and Sassy BBQ dipping sauce.Although bun-less, we thoroughly enjoyed our sausages. Did I mention this was the first time I had ever tried a sausage type dish? I was surprised at how much flavor it had, although the fennel was a bit overwhelming over the other ingredients. Everything tastes really great and cooked perfectly. The fries were probably the best fries Ive ever tasted. Crispy, hot, and salted just slightly enough to get a hint of the flavor. The dipping sauces were also really fun along with the assortment of mustards to choose from. I loved the indoor dining area and noted how well the space was designed and had a very sophisticated and upscale atmosphere for a fast-food type restaurant.Wurstküche is truly a gem in the Downtown Los Angeles area. I highly recommend this place if you're a vegetarian, or not a vegetarian! Theres something for everyone."
    },
    {
        "date": "2014-07-03",
        "rating": "4.0",
        "review": "Sausage Fest.....that's all I can say.They have quite a selection on fantastic flavorful sausages.  I don't have a particular one that I am picky with (Because they're all flavorful in their own ways).What's really nice is their beer selection.  Usually a lot of people don't drink beer that often nor do they appreciate certain tastes for it.  This place however, has beers for all people. Even if you are underage, they have an assortment of soda pops and other non alcoholic beverages.  But man....those sausages...."
    },
    {
        "date": "2014-11-02",
        "rating": "5.0",
        "review": "I've been watching Anthony Bourdain's No Reservation's lately and when I walked in I saw rattle snake on the menu. I thought what would Anthony order. I had to try it and the cooks were highly recommending it so I said F' it. It was great and it really tasted like chicken. If I didn't know it was rattle snake I would have thought it was a spicy chicken sausage. The fries here are king and they got a nice big back room with a DJ and bar."
    },
    {
        "date": "2012-07-14",
        "rating": "5.0",
        "review": "Love this place!!  They won me over with their amazing friendly service and top notch beers. Their sausages are super delish as well.Popped in on a Friday night to pick up some grub for the Hollywood Bowl. We were on a bit of a time restraint and were bummed that there was a line out the door. They turned our frowns upside down when we grabbed the menu to peruse and saw the amazing beer selection.Woot! Woot! Blanche de Bruxelles I love u!!!They had one of my fav beers on draft and it's super rare that I find it. I've never had it in California. First time I had that beer was in Hawaii at a yard house n second time was in Denver at a bar that specialized in Belgium brews. I am a beer nerd.I was in Brussels and asked about this particular beer at the local microbrewery specializing pub and they weren't huge fans because to them it's not a microbrew and the company isn't actually in Brussels it's located in a small town outside of Brussels and as locals they were offended by the semantics. But whatever!! As an American I love this Beer and Wurstkuche had it. If Wurstkuche could get their hands on some Cantillion Gueze I'd be in Heaven. (Hint. Hint.)Ok but I digress back to the review of Wurstkuche.The line was out the door but once you cross the business threshold and make it inside you were allowed to order beer and enjoy it while you wait. There was a friendly white guy in dreads managing the line, taking everyone's orders and shouting em back to the staff. I love that they were trying to keep us happy while we waited. The beers are all served in their appropriate glass. It was fun to see people holding oddly shaped glasses with different colored brews in line. It illustrated the diverse selection.The crowd was totally hipster and super friendly. It was so much fun to stand in line and socialize. It seemed like it was a lot of people's first time there. I could overhear lots of conversations saying so n so told me to order this. Yelp told me to order the rattlesnake and rabbit and that's what I ordered. I was a little scared to eat the rattlesnake sausage as we had just found and had to kill a rattlesnake in our yard a few days ago. I think I ordered it because I had to conquer my fear of snakes and taking a bite out of it would help me take a bite out of my fear. I just hope a rattlesnake doesn't return the favor and take a bite out of me one day!!! My friend ordered the duck and that was good too. I loved that the flavors were so distinctly different. The sausages and the buns and fixings held up well until we finally got them to the Hollywood Bowl were able to settle down and enjoy them. The large order of Belgium fries on the other hand and the chipotle aioli and the blue cheese walnut sauce didn't last long. We gobbled that up on our walk back to the car and on our drive over to the Hollywood Bowl. So Goood!!!"
    },
    {
        "date": "2015-04-15",
        "rating": "4.0",
        "review": "Interesting ambiance with communal tables and friendly vibe."
    },
    {
        "date": "2014-10-14",
        "rating": "5.0",
        "review": "Parking is horrible but it's downtown LA.. It's to be expected.  Otherwise,  it's a great place for really good beer (this coming from someone who doesn't like beer) and great food.  They have exotic  sausages and super delicious  fries. Great  place for groups"
    },
    {
        "date": "2014-09-15",
        "rating": "4.0",
        "review": "first time here but hopefully not my last, next time instead of just having beer i will try their famous sausages. Me and my friends were really doing some beer tasting in the area and wanted to try this place out. overall a good experience and seems like a good vibe place."
    },
    {
        "date": "2015-06-11",
        "rating": "5.0",
        "review": "This place is A+ awesome. The wait is well worth it. I had the rattlesnake and rabbit and the pheasant, both were very delicious and cooked to perfection.The icing on the cake though, what makes me say I'm definitely coming back, is the service and the care the restaurant put in for their customers. As the food came \"late\" (not really that late at all, they were extremely busy, we understood and we were busy socializing anyway), they gave us a side of fries and an ice cream sandwich each, on the house, for being \"late\".Well done, Wuestkuche, you've earned yourself a new customer, and I'll definitely be recommending. A+"
    },
    {
        "date": "2013-09-17",
        "rating": "4.0",
        "review": "You had me at sausages and beer. But, Wurstkuche, you took it to a whole new level, and I cannot wait to come back.It was an interesting concept and didn't know what to expect when I approached the entrance. Oh, just a little bit of a line out the door. I was able to look over the menu to get some ideas. Normally, bratwurst and kielbasa can satisfy me until one of the persons I went with (who has tried various sausages here), gave me a few suggestions. The suggestions, however, were 'exotic.' They had rabbit, alligator, and even rattlesnake. I haven't experienced any of those meats, but I was eager to give it a try. I decided on the Alligator & Pork, Smoked Andouille Sausage with caramelized onions and spicy peppers with a side of fries and their chipotle aioli sauce to pair with it. Also, got a Belgian beer to go with it. $20 bucks later and I'm headed to the seating area. It was nice. There was family style seating and smaller tables. There was plenty of natural lighting, which was beautiful, and each table came with its own condiments. There was a full bar which made ordering drinks hard to avoid. Food came out quick and I was happy with the size. The fries were great, exactly to my liking.  Lightly salted and some were crispy some weren't and I love that. My sausage? Smoky and really tasty. I can't even explain it in further detail, except I thoroughly enjoyed it. Buns? Could maybe use some work. I could understand it may take away from the sausage itself, but I thought I'd throw that in here.I would come here for food and beer. Shoot, I'd even come for the beer. I typically prefer pints at $6 or less so anything that doesn't match that, I pretty much don't come back to. But, I liked this place and the quality of the menu, both beer and food, to  come back again.Lastly, service is wonderful! The guys at the bar are super friendly! Thanks for great customer service, Anderson."
    },
    {
        "date": "2014-06-09",
        "rating": "3.0",
        "review": "Idk, no matter how hard I try I'm just never that big of a fan. I definitely like the Venice joint better and I don't even like that one that much...they just all taste the same! No matter which sausage you get, buffalo, snake, duck, rabbit, bratwurst, etc. (I've tried them all!), when you put them between that excessively bread-y bun, and underneath those excessively butter-soaked peppers & onions, they all. taste. the. same. Everyone goes for the beer and the ambience, it's a schtick, I get it. I just think there are better places to spend $17 bucks for lunch...but the truffle fries are good, I'll give them that!"
    },
    {
        "date": "2014-05-27",
        "rating": "5.0",
        "review": "Errmahgerd, hot dogs. I love how this place closes late! Lines are long,but it goes by fast. They give out samples while you wait in line & when you're inside waiting to order, they get you your beverage as you're waiting! AWESOME. Vegetarian Mexican Chiptole: It has a strong taste.. I didn't like it. Santa Fe Jack Cheese & Jalapeno Peppers: OMG SO GOOD, I WISH I ORDERED MORE!!Sun Dried Tomato & Mozzarella: It had a sweet flavorBockwurst: It came out a little burnt, but it was still good.&& everyone that comes here is suppppper nice! Random people trying to make conversation & talk & drink & eat & have fun. Great atmosphere!"
    },
    {
        "date": "2014-08-21",
        "rating": "3.0",
        "review": "Cool ambiance, tasty beer, unique hot dog recipes. I had the Filipino Marharlika hot dog with spicy peppers and grilled onions, shared an order of large fries, and drank a couple Franziskaners. The hot dog was good, but the peppers weren't spicy which was a bummer. The fries were okay, I got the Thai peanut dipping sauce, and it was just okay too. Overall it's good, I'll go again but it's not amazing. It's all about location, location!"
    },
    {
        "date": "2014-11-17",
        "rating": "4.0",
        "review": "This place is pretty good for a hot dog/sausage spot I have to admit. Came by with some friends who suggested trying this place. Was a little weary because not too big of a fan of sausages but this place was pretty money. The food was good and the beer was great. The place itself is pretty nice. Good layout and seating area. Nice place to go for a casual bite to eat with some friends. Recommend checking it out. My friends really loved it so you might like it more than me."
    },
    {
        "date": "2015-03-20",
        "rating": "4.0",
        "review": "Delicious."
    },
    {
        "date": "2014-06-09",
        "rating": "2.0",
        "review": "***UPDATED REVIEW***Apparently  Yelper \"Rocky M\" has struck again.  It would appear that \"Rocky M\" sends negative insulting private messages to Yelpers who give this establishment a less then 3 star review.  It is a shame that someone has chosen to attempt to bully people about their honest opinions.  I do not know if \"Rocky M\" is the owner, friend, wife, cousin, gardener, or whomever of Wurstkuche but if I were them I would make sure \"Rocky M\" stops bullying and harassing their customers....\"Original Review\"Not impressed.    The location is in a seedy area part of downtown.  The staff is robotic.  The seating is typical German beer hall style and the tables are a good size.They lack all forms of actual tap soda (yet have like 30 beers on tap) and lack ANY diet soda.  The tap water is crappy and takes aware from the meal.  I sampled about 6 of there sausages.  The rattlesnake and rabbit was the best by far.  The Filipino was decent.  The bratwurst was a solid average (which is a shame since it should be their best and I have had much better many places).  The chicken apple was also good.  The bockwurst was a waste.  The buns themselves are hard and have no real taste. The sauerkraut was not that great at all and I scrapped it off. The sweet peppers and onions were good.  The fries are a waste of time.  They have no real taste and despite looking like they have seasoning they don't taste like it.  Overall I would come here only if a group of people really wanted to come but I would not do so by myself."
    },
    {
        "date": "2013-06-18",
        "rating": "5.0",
        "review": "Good gracious. I adore this place. The line here can get pretty lengthy, but with good reason. I've tried pretty much all the 'exotic' sausages, as well as the more tame ones (chicken, beef, pork, other boring meats) and I haven't met a Wurstkuche sausage I didn't like! The rattlesnake is spicy and has a complex, sort of smokey flavor. The alligator, both times I've had it, can get a little dry, but just smother it in some mustard. The fries here are especially good, super crispy and you get to pick your own sauce. You can't go wrong with bleu cheese. The staff here is also really helpful in pairing beer with food. They carry a ton of German & Belgian beers which you can order at the register and if that one isn't enough, they have a bar in the eating area. The eating area can get crowded, and the mustards tend to get distributed everywhere, but if you ask any of the staff there they're more than happy to hunt your desired mustard down. I've come here as a party of two, and with a group of up to 10 people and every time has been a cinch. Service is quick & efficient, and Pie Hole is right across the street"
    },
    {
        "date": "2013-09-12",
        "rating": "4.0",
        "review": "This place is pretty good.  I had the mango jalepeno hot dog, truffle fries, and the fruli Belgian beer.  The beer was good because it was strawberry flavored.  Truly a girly beer.  The hot dogs aren't that big so most my friends got two each, making this place pretty expensive for hot dogs.  I guess people go here for the experience of tasting exotic meat and although it's good, it's nothing special to me so I don't see myself coming here again for a long while."
    },
    {
        "date": "2015-04-03",
        "rating": "3.0",
        "review": "The sausage is delicious! And so many flavors! Just don't like the way that it comes with bread. Prefer the authentic German way"
    },
    {
        "date": "2015-01-27",
        "rating": "4.0",
        "review": "I like coming  here every now and then. Just don't get suckered in getting the rattlesnake rabbit hotdog. It all taste the same.Their sweet potatoe fries are also good too. It's cool spot to hangout and drink some beers with friends."
    },
    {
        "date": "2013-11-12",
        "rating": "3.0",
        "review": "I've been to Wurstkuche probably 10 times, and have always liked it. The way it works is:1) Get in the consistently ridiculous line(~30min - 1.5 hrs later)2) order and pay at the front counter; obtain drinks/beer immediately3) Take your number and go to the back part of the restaurant, where there's a bar with beers on tap and many tables/long communal tables.4) wait 10-20min5) get food and eatIs the food worth the wait? Sometimes. Usually when I go, I get one of their classics ($6) (the brat is great!), and they're juicy and delicious. However, this time, I ordered the pheasant with herbs de provence (8$), and was sorely disappointed. The flavor of the sausage was ALL herbes - where was the pheasant? It was also very dry, which was very disappointing because the menu says that it's juicy! Sadness :(The fries are delicious, however; thick-cut, crunchy on the outside and pillowy on the inside, and piping hot, definitely a highlight. The truffled cheese topping is completely worth it.The bottled lemonade they have is ok; it tastes slightly under-lemony, however.Finally, their toppings: while they're good, I wish they had more variety so that I could customize my order more. Their selection of mustards is great, but the honey mustard (usually my favorite) tasted a bit off this time around.Verdict: Good for a casual stop-in if you have a lot of time to stand in line. Beer selection is great, and their classics + fries are worth it."
    },
    {
        "date": "2014-08-19",
        "rating": "4.0",
        "review": "The only qualms I have with this place is the lines, but they actually go through fast. Great variety of sausages from exotic meats to more run-of-the-mill to accommodate most tastes. I strongly recommending trying two, preferably ones from the exotic section but if that's not your thing, any of the others are great too but it's all about trying different options. Sauces are great and they have a nice variety as well. If you opt for fries, be sure to get the truffle oil. It's a must have.What goes best with sausages? Beer. Before many of the gastropubs had many craft beers on tap, Wurstkuche was there. Imports and local craft beer alike, they have a nice selection."
    },
    {
        "date": "2013-09-09",
        "rating": "3.0",
        "review": "I've been here twice now and have tried the rattlesnake and rabbit sausage and of course spaten optimator.  It's interesting because you have to order food up front but if you don't want food, you can walk straight back to the bar.  There's no waiter/waitress so you do have to go up to the bar for your beer and when you get hungry, you have to walk back to the front and order at the counter.  I thought the rattlesnake/rabbit sausage was good but didn't really find much that distinguished itself.  Perhaps my pallet is not as sophisticated but it just tasted like a gourmet sausage to me.  Still tasty though.  but pricey.  I remember it being about $20 for a hot dog and beer."
    },
    {
        "date": "2015-01-12",
        "rating": "4.0",
        "review": "Great dog, great beer, great atmosphere but long wait. It's worth it if u haven't tried it but not worth the long wait if ur hangry since it's usually over an hr by the time you get your food. Try coming back on a less crowded day or time."
    },
    {
        "date": "2014-06-24",
        "rating": "5.0",
        "review": "Finally, some quality German-ish sausages in this taco land that LA is! Try all of them! Better yet, try'em all at least twice! The draft beer selection is FAN-TAS-TIC. Yes, it's noisy, hipstery, yada-yada, and, yes, as someone who has had actual Belgium fries, I can attest to theirs being as Belgium as pizza is. Truth be told though, it's still the greatest place to go when you're craving some awesome sausage."
    },
    {
        "date": "2014-10-19",
        "rating": "5.0",
        "review": "Great place!! I brought a friend with me from England and we truly enjoyed it. Be prepared to wait in line out the door 30+ minutes but it will be the best 30 minute wait of your life!  The choices are galore both got the sausages and beer!! You will not be disappointed!!  Highly recommended!!!!"
    },
    {
        "date": "2014-09-15",
        "rating": "4.0",
        "review": "It's a fun place to eat in the DTLA Arts District. They offer rattle snake & rabbit with jalpenos sausages along with regular fare. They have a great beer selection on tap. The food is wonderfully served! The place is cool and dark on the inside, so you enjoy everything on the DL, unless you'd like to enjoy the outdoor tables with the view of the excentric locals on the sidewalk outside."
    },
    {
        "date": "2013-04-24",
        "rating": "3.0",
        "review": "At the risk of sounding like an asshole, I don't get the hype over this place.  Given my feelings about this place and Pink's, I'm beginning to think maybe I just don't like fancy hot dogs.  Which is weird since I love fancy hamburgers.  But I digress...So the main reason this place is famous is because it has a lot of exotic ingredients in their sausages like alligators, rattlesnakes, rabbits, etc.  But.... what's the point of eating exotic animals when they're all ground up and squeezed into casing?  You can't even tell what animal you're eating.  If I'm eating gators and rattlesnakes I want to be able to taste the wild, dammit!Their weiners are pretty tasty and interesting, but I just don't really get the hype over this place.  You can find tasty interesting weiners at Ralphs without the wait.  It's very hipster, there's always long lines, and overall I feel like it's quite overhyped."
    },
    {
        "date": "2012-03-20",
        "rating": "5.0",
        "review": "Ok I don't want to sound childish but how the heck do you pronounce this place?! I won't even say how I think it's pronounced because it sounds Rated-R lol. Anyways, I finally got to check this place out and I'm so glad I chose this place over the other amazing restaurants to eat in LA.  I ordered the duck & bacon w/ jalapeno peppers topped with grilled onions and spicy peppers, my friend ordered the hot italian with grilled onions, we shared the groot belgian fries (the large w/ two sauces: we chose chipotle ketchup and the sweet and sassy bbq), and we both got the franziskaner (THE BEST GERMAN BEER EVAAAA).I was waiting anxiously for the food to arrive and saw that every table had 5 different mustards and ketchup. I LOVE MUSTARD and I tried every single one and they were all equally good. I didn't even need the sauces for the fries the mustard was perfect for me and I put a good amount on my sausage as well.  The sausage was AMAZING it was juicy and a little spicy (the spicy peppers and onions made the sausage over the top...i LOVED it!!!!)Overall my wurstküche experience was amazing and I can't wait to do it again!!!"
    },
    {
        "date": "2013-08-29",
        "rating": "4.0",
        "review": "I visited this place with a group of friends.  We all decided to get different kinds of \"exotic\" dogs and try a bite of each.  I chose the rabbit, veal, and pork sausage and topped it with caramelized onions and sweet peppers.  Mine was the best.  ^_-What I appreciated the most was their large selection of beers (they'll offer a few samples if you can't make up your mind) and the different types of mustards they keep on the tables for you to portion out as you see fit.  With the music going, long tables where different parties can be forced to squeeze in next to each other, and the laid back staff, this is the sort of place I can see myself just grabbing a bite with a friend or two after a long day."
    },
    {
        "date": "2014-07-12",
        "rating": "4.0",
        "review": "Sooooo the only way I found out about this place is because parking downtown LA sucks. While having to park a mile away to get to my original destination I walked upon this sausage joint.The line was hella long so I was like oh well I will try it one day but not today (not a fan of lines).Make it to my original destination and guess what??? Left my ID in my other purse. So on my way back to the car I noticed the line was waaay shorter than earlier so I was like I better get in where I fit in.Now on to the food. My friend ordered the Rattlesnake & Rabbit. I guess its delicious because he devoured it as if he was a damn snake himself. I personally can't eat the cute animals (sorry Thumper).I had the Duck & Bacon with jalapeno peppers. DaBomb.net. It was so flavorful! We shared fries with the Blue Cheese Walnut & Bacon dipping sauce . I heart blu cheese. So again it gets pretty packed because once you get your order # it was pretty hard to find a table inside and outside so we just sat at the bar. 5 stars for staff tho. They were pretty attentive."
    },
    {
        "date": "2015-04-26",
        "rating": "5.0",
        "review": "Discovered this place about 5 years or so ago, when they first opened. Not sure what as taken me so long top write a review, but this place is legit! The sausages are delicious, even the more gimmicky ones that have game meats. But what makes this place shine are the traditional german sausages, the Belgian ales, and especially the Kölsch."
    },
    {
        "date": "2012-02-18",
        "rating": "4.0",
        "review": "It's pronounced, \"WURST-KOO-HAY\"!  Or at least that's what my friend who once had a conversation with a German person tells me.  And in German it means sausage kitchen (thank you, Google).   And to think I've been saying \"WURST-COOCHIE\" this whole time!  I sure saved myself some embarrassment should I ever come across a German who wants to talk sausages with me.Yeah, not much else needs to be said of Yelp's #4 most popular restaurant of 2011.  I've been a few times and it's quite good.  I fancy their classic bratwurst ($5.75) or the kielbasa ($6.50) with caramelized onions over their exotic sausages ($7.50).  However, there is certainly some novelty in saying you ate rattlesnake, alligator or rabbit for dinner.Their Belgian fries are a must!  A small order will set you back $3.50 and is enough to share with a friend or two.  The white truffle glaze for $2 extra didn't do much for me though.  I love their selection of dipping sauces.  My faves are the chipotle aioli and pesto mayo, but my friend swears by the tzatziki (Greek yogurt sauce).  To each their own I guess.  Wash it all down with some of their exotic beers, wines or strange sodas and you're golden!"
    },
    {
        "date": "2015-02-23",
        "rating": "4.0",
        "review": "Excellent vegan sausages and beer. Definitely makes my German blood happy. The vibe is a little on the hipster side for my taste, but the good food makes it worth a few side eyes by the hipster crowd."
    },
    {
        "date": "2014-09-07",
        "rating": "5.0",
        "review": "Beer and German sausage! What more could you want. I tried the duck jalapeño and the pepper jack turkey sausage. They were both tasty. But what was really good was the oatmeal ice cream sandwich! Large selection of beer also. The decor of this place is good."
    },
    {
        "date": "2014-07-16",
        "rating": "5.0",
        "review": "WURSTKÜCHE? More like BESTKÜCHE.I obviously have a limited understanding of the German language, but you know what I don't have a limited understanding of? Brats, beer and mustard. I ordered the Filipino Maharlika sausage which, as a huge fan of longanisa, was on POINT! With about 7 different variations of mustard to choose from, and a love of all of them, I applied the mustards to my brat bite-by-bite. I must say, the spicy brown was the best one. This, paired with a nice beer made for a wonderful Friday afternoon. Go!"
    },
    {
        "date": "2014-06-19",
        "rating": "3.0",
        "review": "Solid beer selection with tasty vegetarian sausage options ! Fries done properly !! Service is excellent !!"
    },
    {
        "date": "2014-05-03",
        "rating": "5.0",
        "review": "Great place to eat! Biggest beer selection, tasty wurste, dj is playing nice music. Like to come back!Very chill and relaxing. I think you can come here anytime."
    },
    {
        "date": "2015-04-24",
        "rating": "5.0",
        "review": "This place is great, food is good and there beer selection is good as well. If you get French fries get them truffle style.. Do not be scared of the rattle snake and rabbit, it's amazing and full of flavor..."
    },
    {
        "date": "2012-03-06",
        "rating": "5.0",
        "review": "I have no idea how to correctly pronounce the name of the establishment because apparently \"Worst Coochie\" isn't it.  But whatever it's called, they make the best gourmet sausages I've ever tasted.  I've tried several different sausages and all of them were amazing.  If you like spicy, the Louisiana Hot Link has a good kick to it, and you can off-set the spiciness with some sweet peppers and caramelized onions.  The Chicken Apple is also very good - it has a subtle sweetness to it and I like to get it with spicy peppers and sauerkraut.  And as a former vegetarian, I can say that the veggie choices are legit too.  The Mexican Chipotle is my favorite.  Don't forget to get an order of fries.  Their fries are gigantic steak fries and if you like truffle oil, get the glaze add-on because it will knock your socks off.  And if you need help deciding which sauce to get, I'd recommend the Chipotle Aioli.  After all this grease, you will definitely need a beer or two.  Wurstkuche has an amazing beer selection.  For the ladies who aren't huge fans of beer, I'd get the Floris Apple Ale.  It tastes pretty much like sparkling apple cider, but after you finish the glass, you will notice that you have a tiny buzz going on."
    },
    {
        "date": "2014-08-21",
        "rating": "5.0",
        "review": "Wow... Its all about the service here. My GF is vegan and she can be tough. Everyone was very kind and knew all the options for her. Manager was running around making sure the restaurant was an well oiled machine. It has been a while since I walk into a place and can't find one thing wrong. Plus! they have Spaten Optimator on tap and serve it in a proper glass."
    },
    {
        "date": "2012-01-31",
        "rating": "5.0",
        "review": "This is one of those places that will keep you coming back for more, even if you are ordering the same thing everytime. Wurstkuche is cutesy little gastropub located in DTLA. Upon first walking in, you are bombarded with the long line that can take a while, but it is definitely worth the wait. Feel free to look over the menu, watch foodies snapping pictures and sip on some cucumber water while you are waiting. I've been here about 3 times and have been impressed each time. Once you are done ordering you are free to walk down the long hallway into what feels like a fancy mess hall. A wall full of 2 seater tables and 2 long benches for all to share.If you have personal space issues don't come here. This is the place to mingle with fellow LA peeps and foodies. & get ready to get messy! Im not a veggie but I Love their tomato, mozzarella & basil sausage! I tried the farro veggie sausage... Definitely didn't fancy it at all. Their duck & bacon one is Delish too! Oh & their fries are mouth watering and become even better when you get the bleu cheese & bacon .... And.... The ketchup curry dipping sauces! Yes yes yes.... Everything about this place is good. The ambience, food, drinks, booze, friendliness of employees & location. You'd be crazy not to come here! :)"
    },
    {
        "date": "2013-06-09",
        "rating": "3.0",
        "review": "Man, I am behind on my reviews! Sorry that these are now going to be slightly out of chronological order. Oh well!Ok, so I really don't know why Wurstkuche is so popular. Its menu is definitely a novelty, but maybe it's just me.. they taste like regular sausages. I had the rattlesnake/rabbit sausage as it was the most exotic one available, but it wasn't anything special. The fries were good but also nothing special.Their selection of beer is pretty good. Unfortunately for me, I never really remember what I like and what I've tried, so I decided to go for something I've never tried: strawberry flavored beer. It was pretty much like soda.. or hard cider.. you get what I mean. I don't think they mention how big the beers are cuz my strawberry juice/beer was really small compared to my friend's Blue Moon :[ We went on a Sunday for lunch, and it was pretty poppin. We managed to find a seat in this little table wedged into the corner. I think it could be a cool bar (maybe it's like that at night..)I liked the location though.. It was kinda east of Little Tokyo. Lots of street art/ graffiti and a handful of geocaches around. However, since I live in the valley, coming out to east LA is pretty far (I know there's another location in Venice), but even if it were closer to me, I don't know if I'd necessarily come back."
    },
    {
        "date": "2014-09-03",
        "rating": "5.0",
        "review": "In the two times I have been here during my trips to LA, both occasions were during Fourth of July. Nothing like celebrating America's independence by eating German sausage. USA! USA! USA!I haven't found a place like this in San Diego so I always look forward to coming here when I'm in LA. I'm not too adventurous to try their more exotic items (still working on it) but I am a fan of their Sun Dried Tomato and Mozzarella and Mango Jalapeno sausages. And always gotta get that order of Belgian Fries (the Thai Peanut sauce is my favorite!). The drinks they serve are also good AND you can even order them as you wait in line to order your food. Yes! :D"
    },
    {
        "date": "2014-07-19",
        "rating": "5.0",
        "review": "This should be the typical Wurstkuche review: \"it's Wurstkuche. End of story.\" It really ought to be Bestkuche! Haha! This place has got to be one of the best restaurants overall, in L.A. I've been going for years and still haven't gotten sick of their sausage and fries! I don't think I ever willl either. My only complaint is that there isn't enough American brew. Otherwise Wurst is a solid five."
    },
    {
        "date": "2014-11-07",
        "rating": "5.0",
        "review": "We came in July, we were on our way to go to a bachelor party, and wanted to get some great food to fill up on, and have a few beers to start. Blake the manager is amazing, and everyone behind the counter was so accommodating.This place is quite simply fantastic! The food is interesting and delicious! The atmosphere is simple clean, modern with an energetic crowd.Highly recommend. Thanks again."
    },
    {
        "date": "2012-08-14",
        "rating": "4.0",
        "review": "Came here on a Sunday for an early dinner and it was pretty busy.  It took maybe at least 15 minutes of circling around the vicinity of Wurstkuche looking for street parking before I gave in and paid $5 to park in a lot.  We waited about 15min in line to order split 3 sausages and the groot belgian fries between two people.  1.  Kielbasa- polish style pork & beef, onions & spices with Sauerkraut and Hot Peppers.  The Kielbasa was AMAZING! Very flavorful.2.  Sun Dried Tomato & Mozarella - Smoked Chicken and Turkey with Carmelized Onions and Sweet Peppers.  Delicious! Not too heavy and still juicy and well balanced. 3.  Austin Blues -Hot and Spicy, tri-pepper & hardwood smoked pork with Sauerkraut and Carmelized Onions.  Wasn't my favorite, was a bit bland in comparison to the Kielbasa and Sun Dried Tomato & Mozarella--but still pretty good.   For our belgian fries we had the choice of two dipping sauces.  We ended up getting the Bleu Cheese Walnut & Bacon and the Curry Ketchup.  I was dissappointed in the Bleu Cheese Walnut sauce...it didn't have much taste or flavor to it.  The Curry Ketchup on the other hand had a blast of flavor.  It was good, but I'm definitely curious as to what the other sauces taste like.  I think it'd be cool if Wurstkuche just had all the sauces available to everyone, I think that would be an aspect that they should incorporate, especially if they wanted their patrons to fully enjoy their meal.  Just like how Chick-fil-a has all those sauces available for their chicken, all sauces should be readily available for their sausages!  I think the limitation slightly bothers me.  Despite that, Wurstkuche is delicious!  I'll definitely be back again!"
    },
    {
        "date": "2015-05-01",
        "rating": "5.0",
        "review": "Excellent Service and atmosphere! Very clean! Huge selection of brats and beer! Must see!!!"
    },
    {
        "date": "2015-07-14",
        "rating": "5.0",
        "review": "This is definitely the place to go for anyone looking for good sausages and unique exclusive sausages. Best beer selection and best sausage selection. Fries are top knotch as well!!"
    },
    {
        "date": "2015-10-08",
        "rating": "5.0",
        "review": "This place is awesome. There's a big selection of brats, sausages and hotdogs. I know what your thinking be cut I thought it myself before I ate here. It's just a hotdogs place? Ya a really damn good one. It's like the In-N-Out of hotdogs. The line gets long so grab a beer from their entertaining host who mingles with the crowd. And if you are hungry, grab 2 dogs, it's worth it."
    },
    {
        "date": "2014-05-08",
        "rating": "5.0",
        "review": "Most of the people cant pronounce this name but the food is delightful. Wide selection of sausages and excellent selection of great beers (yes, I said beers, lol) on tap. I still like the classics like pork bratwurst but the rabbit and rattler sausage is pretty good too. I love the communal tables and the cool ambiance inside.Really great place to meet with friends for a pint and bite session."
    },
    {
        "date": "2014-08-07",
        "rating": "5.0",
        "review": "For being someone who doesn't like sausages.. I make this place an exception. I've been here a couple of times and have found that despite my lack of love for sausages, I cannot help but love the food here. I'm not much of an exotic eater so I've tried the more normal tasting sausages such as the mango and jalapeno ( which is really good a bit spicy and sweet) the chicken and apple sausage which is so good and you get two, and the sun dried tomato and mozzarella which is just quite yummy and cheesy. I don't really like salty sausages so all the ones I've mentioned are more of the sweet tasting one. You also get a choice of sweet peppers, spicy peppers, onions, and saurekrat. The fries are so so good they are crispy and with the variety of sauce you can't go wrong. I usually go for the chipotle ketchup for a little kick. The atmosphere is pretty chill you go order and then take a number and go sit down. Most of the time there is a line but it's not too bad. It's also pretty nice to sit outside during cool nights. Inside the seating has a bunch of long bench tables so it's good for large groups. If you have a huge appetite I recommend you getting two orders of sausages just because the portions are not that large. This is definitely a place if you want to try a variety of different sausages and yummy german fries :D"
    },
    {
        "date": "2015-10-19",
        "rating": "5.0",
        "review": "Been here quite a few times. First heard about this restaurant through people I follow on Twitter. Got the Alligator and Pork, and Rattlesnake & rabbit. Food exceeded my expectations. The blue cheese walnut and bacon dip, compliment the Belgian fries with truffle oil so well. Also the chipotle ketchup. Sadly, alligator and pork is no longer an option, but it won't take away from me being a patron. Buffalo, beef, and pork is also a good choice. Duck & bacon is great too! Beers are awesome. From Aventius to St. BERNARDUS. Special thanks to Paulina and Mark, for making us feel at home, every time we go. Great customer service, as they provided me with a side of peppers for my food, upon request. Most definitely need to come back soon. Please Wurstkuche, bring alligator back! I miss it. Lol"
    },
    {
        "date": "2011-11-29",
        "rating": "4.0",
        "review": "Yay for sausage fest! I came here on a Friday night and there was quite a bit of people in line, but that didn't deter me or anyone else from waiting. We waited in line for about 20-30 minutes. They even gave us samples while we waited in line and they let you order your beer while waiting too so that's a plus!Everything on the menu sounded so good, but I opted for the duck, bacon, and jalapeno dog with caramelized onions. I also got a large order of fries with pesto mayo and chipotle aioli sauce. They give you a number and then bring your order to you. I love the vibe of the place...its a pretty dark room with a dj and a bar. Definitely a fun atmosphere. The dog was a good size; not too big and not too small. It was enough for me. The caramelized onions on my dog was delicious. The fries there are addicting!!!! I wanted more after I finished it.They were super fresh. I loved the dipping sauces that I got with it as well and even used the sauces for my hot dog! Overall, the dog was good, but the fries were the highlight of my meal! I will definitely be back! They have a very good selection of beer or rare nonalcoholic drinks as well!"
    },
    {
        "date": "2014-08-05",
        "rating": "4.0",
        "review": "Sausage in a bun? Humm...I guess you could classify that as a glorified hot dog!This place is definitely not fast food Wienerschnitzel. I really like this place, the experience and service was excellent! Order beers in line while waiting. The line was fast and efficient, the community dinning area is awesome. very unique setup. I'm not gonna go into detail to much on what the food tasted like, since it was my first time there. I want to give this place another go, before I can give an honest opinion on the food. I can tell you that the fries and chipotle mayo are off the hook! And beer selection is awesome!"
    },
    {
        "date": "2015-01-13",
        "rating": "4.0",
        "review": "Delicious sausages with flavorful toppings in a quaint and mimimalist setting. Plenty of mustards to add to your smoky sausages. Go here. Small tastes would enrich the experience.! Yum"
    },
    {
        "date": "2015-03-22",
        "rating": "4.0",
        "review": "It's hot dogs and great beer. Other than the pretentious atmosphere. It's a good place to hang out. Ignore the imbeciles that think they know what they're talking about and you're good to go. They always run out of steins. Try anything you think is weird. It's not."
    },
    {
        "date": "2014-08-04",
        "rating": "4.0",
        "review": "Walk in to a closet decorated with a grill and a few bar seats. The cashier didn't seem too thrilled to work- in his defense it IS work. ( I need to excuse the negative to appreciate the positive of this place. After ordering ( rattlesnake and rabbit hotdog is fantastic) you head down this corrider to the unknown. The other side of the store was awesome! Row of seats, this interesting nook, and a huge bar. I was oveewhelmed by this place- positive inundance. Rattlesnake rabbit was delicious. My friends duck hotsog was good as well. Cucumber soda is a must! Huge variety of beer if you are a fan. Definitely will come back. Great service in the heart of the art district."
    },
    {
        "date": "2011-12-07",
        "rating": "3.0",
        "review": "Let me borrow a turn of phrase from Yelpers Amie C. and Victoria B.:\"I WANT WIENERS.\"And so here we arrived, in Wiener Town.Wurstküche is a trendy joint located in a corner near Little Tokyo.  The place is dark as shit inside, but that means it's super cool.  And how apropos - the prices are pretty steep.To be fair, however, they do offer some foodie fair that's quite out of the ordinary.  Rabbit and rattlesnake?  Alligator?  Buffalo?  They've got you covered.  And this kind of justifies their asking prices.I had the Rabbit and Rattlesnake and a side of their Fries with the optional White Truffle Oil Glaze.[PIC: yelp.com/user_local_phot…[PIC: yelp.com/user_local_phot…Maybe I was just really tired (or drunk) but I couldn't discern that much of a difference between the Rabbit and Rattlesnake and a normal hot dog.  Now the easy joke here is that a normal hot dog probably has rabbit, rattlesnake, and more - but that's probably less a joke and more just true fact.The fries were fairly tasty but with the Truffle Oil, a small order came out to just under $6.  Sorry - it wasn't worth that much to me.But hey - this place satiated my need for wieners so that's gotta count for something, yeah?  And my need for wieners is INSATIABLE.I'm never gonna grow up."
    },
    {
        "date": "2015-09-03",
        "rating": "4.0",
        "review": "Nice place that has reminiscence of a German beer garden, at least probably as close as it get here in LA. Food and drinks are a little overpriced. If you were looking for actual German sausage like I was you'll be disappointed. But hey, this is LA and everything's just fusion food. I may/may not go here again depending on how much I miss Germany. Really good to just hang out with friends and some beer."
    },
    {
        "date": "2011-12-16",
        "rating": "5.0",
        "review": "I found this place in an effort to find Belgian Fries as good as the ones that I had in NYC. Although the fries here aren't the best I've had, they're pretty freakin delicious and beats flying across the country to get some fries. I ordered a large order of fries with truffle oil (an extra $2) and the chipotle aioli and pesto mayo dipping sauce. I love having the sauces layered on top of the fries so that it kind of blends in all together but they don't do that here :( The fries weren't really fresh-off-the-fryer hot and the truffle oil made it a little bit too salty, but they were absolutely delicious. The sauces made the fries even better, although I can't say which sauce was better because I double dipped the sauces together (which made it taste great).yelp.com/user_local_phot…I also tried the rattlesnake and rabbit sausage with caramelized onions and spicy peppers. The sausage so juicy and flavorful and the caramelized onions and spicy peppers added even more taste to it. It was soo good that I didn't even notice what the bun tasted like.We came pretty late so there was no line but it was still pretty crowded inside. I can't wait to come back for more Belgian fries and all the different kinds of sausages. Next time I'm thinking of just pouring/layering  the sauces on the fries myself and it will be delicious. YUMMM."
    },
    {
        "date": "2015-02-17",
        "rating": "5.0",
        "review": "Tasty goodness abounds! Excellent meats and probably some good veggie eats if that's your thing. Nice craft liquid nourishment options too!"
    },
    {
        "date": "2013-07-12",
        "rating": "5.0",
        "review": "Loved it here! Came on a Sunday so parking was not too bad. The front of the place is where you order your food and then if you walk past that down this long hallway you get to their large seating area with bar and outside area too. Great selection of beers, Franziskaner was my favorite of the ones I sampled, but I do want to go back and sample more. I had the Mediterranean lamb hot dog and it was soooo good. Juicy, flavorful and the toppings accented it perfectly. Beer and sausages really are perfect together.  Oh, and the fries are also excellent - loved the blue cheese, walnut and bacon dipping sauce. I definitely want to go back to sample more of the beer and sausages, especially the exotic ones (duck, crocodile and rattlesnake, oh my!). Great place for a group of people and the very wonderful added bonus of a fantastic live disc jockey. Win-win."
    },
    {
        "date": "2012-07-11",
        "rating": "5.0",
        "review": "We ordered Austin Blues, Hot Italian, Large fries, an orange soda, and a boxed water.yelp.com/biz_photos/KQBG…The Austin Blues was ok, but a little bland. Also, it was a little smaller than the bun so you ended up with a couple of bites of just bread. That was ok though, because the bread/bun is very very good.The Hot Italian extended beyond both sides of the bun and had a lot of flavor. Would definitely order this one again.We tried a couple of sauces, but the fries were the best with Chipotle Aioli and their honey mustard. It took a lot of self control to not order another side of fries.They also have a very nice selection of Belgian and German beers. Unfortunately, I was a bit hungover and didn't get to try any. Just gives me another reason to go back soon!"
    },
    {
        "date": "2012-07-11",
        "rating": "4.0",
        "review": "This place is pretty well known and I've always wanted to try it. Located in Jtown, parking is pretty tough, try to find free street parking by circling a few times. This place is seriously easy to miss walking around the neighborhood. You order first and then go to the back room where you seat yourself. If you're getting beer, I'd wait till you're in the backroom bar so you don't hold up the cashier.My friend and I got the rattlesnake and rabbit. I gotta say the rabbit was freaken amazing. The rattle snake was alil more disappointing but the RABBIT was so damn tender, noms! =D"
    },
    {
        "date": "2015-02-01",
        "rating": "2.0",
        "review": "My second time here, but sadly my last.  Just not worth the headache of trying to find parking for decent sausages, terrible fries, and mediocre service (front was good, but back was terrible.)Had several sausages including the rattlesnake, kielbasa, hot italian, filipino, and duck.  They were all pretty good, but to be honest they all tasted about the same.The fries were terrible...i mean if i am going to waste calories on fries, they'd better be good.  These tasted like the oil hadn't been changed...jusy kind of \"eh\".  Oh and if you do go and if you don't head my warning on the fries, the large easily serves 3.The line was long (on a sunday) which is fine but why not at least have a second cashiwr working?  The food took around 10-15 min after we ordered.  The people in the back were not helpful at all...how hard is it to get a \"doggy bag\"?  At this restaurant...very...literally had to ask 3 people!I came back a second time because i had fun the first, but this experience was so underwhelming i wont me back.Dinner for 3 for us was $70.  I would expect a doggy bag for that price at a sausage place. :)"
    },
    {
        "date": "2012-02-05",
        "rating": "3.0",
        "review": "All in all, thought this place was a bit over exaggerated.  I have to say the hot dogs are pretty unique though.  Rattlesnake and rabbit hot dog?? Never even heard of that or have eaten rattlesnake before.  Duck and Bacon hot dog?? Who would have thought.We've got both of those hot dogs, they were ok. Both of those hot dogs kind of tasted the same, but a bit different by the spiciness.  I could have just been fine with a regular hot dog.  The curry ketchup was delicious with my fries!  They definitely got that one spot on.  This place is a nice place to just chill, eat, and drink.The ambiance and the interior was pretty cool though.  Service was good.  Kuddos to that."
    },
    {
        "date": "2013-07-09",
        "rating": "5.0",
        "review": "I have been to both the Downtown and Venice locations --which have pretty much the same exact atmosphere in my opinion. I always get the Spicy Italian, some sort of light beer, and the fries with the Chipotle Aioli which is AMAZING!!! This is a great place, it's a little loud, but fun none the less. The energy is perfect for starting a night out,"
    },
    {
        "date": "2012-04-07",
        "rating": "5.0",
        "review": "WOW! I've been waiting for a restaurant to blow me away for some time now and finally the drought is over! A fellow yelper suggested that I try Wurstkuche if I was ever in the LA area, so I figured why not, sausages are always a pretty good way to go. My friends and I got there around 10pm after the Clippers/Warriors game and the line was out the door (definitely expected, have you seen how many reviews this place has?!). I was feeling adventurous so I decided to give the Rattlesnake Rabbit Sausage a try, this was the most amazing combination ever!! So juicy, savory, and spicy all in a plump sausage neatly nestled in a toasted fluffy house-made bun. I topped it off with grilled onions, sauerkraut, and dijon mustard.  I was super hungry but I knew if I scarfed down my sausage I would be extremely disappointed in myself for not savoring every bite. I also got a chance to try the St. Bernardis Beer - 100pt beer, so flavorful and refreshing, I couldn't believe that it was 10%! This place is a little pricey for sausages but the atmosphere and food really makes up for it. Pretty trendy spot in the art district of downtown LA, I absolutely loved my experience here."
    },
    {
        "date": "2014-12-02",
        "rating": "5.0",
        "review": "Great beers on tap & bottle. Love the food. Probably the best fries I've had so far... Plus the DJ is cool. ONLY downside is the LONG lines sometimes. But who wouldn't wait in line for this place???"
    },
    {
        "date": "2015-09-03",
        "rating": "3.0",
        "review": "Good variety but what kills it is the ridiculous long line and high price for what you are eating. Exotic ingredients but average in taste."
    },
    {
        "date": "2015-03-04",
        "rating": "3.0",
        "review": "Staff is great , ambiance is chill , food is good but for some reason I didn't feel like I got value . Definitely recommend though if Your craving a good German sausage ."
    },
    {
        "date": "2013-02-19",
        "rating": "4.0",
        "review": "Had to stop by here. Just look at the number of reviews. First things first. Long, long line one a Friday night. I was glad it moved quickly. Once you get your order in you can go in the back which has modern German beer-garden set up with long tables you end up sharing with strangers.Great selection of European beers. Very long list that will keep most people happy. The sausage selection is equally vast. Had the lamb, rabbit and veal, with a classic Bratwurst. All 3 were great but Bratwurst and lamb took the cake. I did think this place is on the pricey side but well worth it."
    },
    {
        "date": "2014-05-29",
        "rating": "5.0",
        "review": "This black bean noodle sooooooooooooooo good. Jjamppong also good too but mostly the manager in this restaurant so gentle. You should come join here!!!!Its in 6th and alexandria"
    },
    {
        "date": "2015-03-28",
        "rating": "5.0",
        "review": "This Dog will hunt. Creative spicy brats in a fun cool space with excellent fries and sauces to boot! Guter Hund!"
    },
    {
        "date": "2014-07-29",
        "rating": "4.0",
        "review": "Went there a few times over the last couple years but most recently went there to watch the World cup games. It was a great time and it was really packed. The beers and sausages are delicious and the atmosphere is very German. I only wish the world cup wasn't over so I could go back and watch more games!"
    },
    {
        "date": "2014-06-30",
        "rating": "4.0",
        "review": "This is a fun, little establishment, but it may be a little confusing for first-timers. Upon entering the door at the corner, you'll think it's just a watering hole and wonder where can you order food. There's another side door, which leads you to the actual ordering counter where you can order the most interesting meats in a sausage. I have yet to try all the menu items, let alone the exotic meats, but they have all been delicious. Burst of oils and juices are expected with each bite. The fries are really soft and crispy on the outside and are paired nicely with two sauces of your choice. This place offers a wide selection of beers, and I really admire the effort in using the properly shaped glasses that are used to accentuate each.  Lunch time seems to be the better time to come here since it's much quieter and easier to find a place to sit. Overall, great food with friends, but it gets pricey when you order a few drinks."
    },
    {
        "date": "2013-04-11",
        "rating": "4.0",
        "review": "This place is awesome! Who knew a sausage place could have so many great reviews!I love how simple the menu is. It's clean. Start with your TOPPINGS: you have 4 choices and I would go with caramelized onions and spicy peppers! Choice of MUSTARD: They have a selection of mustards and you get to choose one, I usually go with spicy brown or yellow mustard. IF you don't want mustard they also have ketchup.SAUSAGES:So many to choose from! and they have some weird ones like rattlesnake and rabbit meat sausage. That is just too exotic for me. So far I've tried Mango Jalapeno, Lousiana Hot link, and Kielbasa. They were all excellent! The mango one is slightly sweeter which i loved :) They were all cooked to perfection and they taste amazing. AHH SO GOOD! I definitely want to try more. So far the mango jalapeno is my favorite!You can also get belgian fries! And you should :D Their fries are crunchy and their dipping sauces are great! I love their chipotle aioli sauce, it is amazing with their fries.They have so many choice dipping sauce and i just want to try them all! You could also get it plain with just truffle oil if that's your thing :) The beer selection here is also pretty big and it's the perfect pairing for their sausages! The place does get pretty packed and their could be a wait. The ambiance is super casual and their dining area was similar to a school cafeteria with long wooden tables separated by napkin holders. The service was pretty good and I would come back just to try all their sausage flavors!"
    },
    {
        "date": "2015-02-13",
        "rating": "4.0",
        "review": "Went here for lunch yesterday with a friend. Had the Mango Jalapeño chicken and turkey wurst. It was good and satisfying. Got it topped with carmelized onions and sauerkraut. It was basically a glorified hot dog with a German twist, I guess? Wouldn't know too much about German cuisine considering I've never been. But, all in all, I was happy! Casual and laid back without any hipster pretentiousness! Always have a good time when I'm in the Arts District!"
    },
    {
        "date": "2012-01-02",
        "rating": "3.0",
        "review": "So...this will be an interesting review.Two vegetarians decide they want dessert after eating yummy ramen in nearby Little Tokyo. My friend finds Wurstkuche via her yelp app and eyes the apple pie ice cream sandwich. We map it. It's within walking distance. And we're off on an adventure!We followed the gray brick road and the walk alone there was worth it. We're huge street art fans and we clicked away taking pictures left and right as Wurstkuche is in the Arts District. Can't get any better than this for is.Wurstkuche is slightly hidden, even the entrance is a tad misleading. It's almost like you walk into the rear of it (maybe we did?).  No one greeted us. Granted I'm not expecting a red carpet treatment, I just wanted a smile and a hello. Instead we got confused looks (maybe because my 9 year old son was with us...bringing a 9 year old into a beerfest restaurant?).  We ordered our dessert, paid the $5 plus for it, and entered the eating area. It's Hipster Central. Everyone was eating sausage of some kind.  I didn't mind it, but I knew I wasn't going to eat there.Ice cream sandwich was yummy. Seating area was cool.  If you want to impress a date or a friend with this out of the way hipster joint, you just might. The walk around that neighborhood is more impressive though :)"
    },
    {
        "date": "2013-02-20",
        "rating": "3.0",
        "review": "So over the past weekend, I ended up eating rattlesnake...and it was quite underwhelming, to say the least. I heard about Wurstkuche through some friends on Facebook and Instagram and was curious after seeing that many sausage concoctions. We arrived around 8PM and found a rather long line extending to the outside of the restaurant. The wait took over half an hour, which was to be expected, judging by the popularity of this place. I decided to go with the Rattlesnake& Rabbit w/Jalapeno Peppers hot dog, topped with sweet peppers and caramelized onions, since the menu described this  sausage as mildly spicy with a buttery taste. I also split a large order of Belgian Fries with truffle oil with the rest of my group. Now I've heard that reptile meat is actually quite mild and a bit reminiscent of chicken, so I wasn't expecting any weird or off-putting tastes. Actually, it just didn't really taste like anything at all. At least not much different from that of any other dirty dog I could get off the streets of LA. The sausage had a bit of a kick to it but the peppers and onions did most of the work on my palate. The Belgian Fries were nothing special either, as we paid an extra $2 for truffle oil, but were asking ourselves, \"Um, where's the truffle?\" Just like any other thicker cut fries, some of the pieces were soft and mushy while others were crunchy. This was a side dish that we could've done without. Located in a quiet yet hipster neighborhood, this place is more about the hype of trying exotic meats. I mean, besides watching Bizarre Foods with Andrew Zimmerman, where else are you going to get much exposure to eating stuff like crocodile, rattlesnake or buffalo? Come here to try it for the sake of trying it, but don't expect any wild, culinary awakening."
    },
    {
        "date": "2015-03-16",
        "rating": "4.0",
        "review": "If you want a really incredible brat this is the place. They have a lot of variety and a really great back patio. It's in the arts district as well so you can walk around and check out some great street art. Great ambiance and menu. Definitely a must-visit. The lay out feels a bit weird, but it's a lot of fun."
    },
    {
        "date": "2014-08-13",
        "rating": "5.0",
        "review": "Rattlesnake + Rabbit + Saison = Happy girl. Really nice staff + frites, too."
    },
    {
        "date": "2014-01-16",
        "rating": "5.0",
        "review": "I called to ask what time they open and the dude that answered made me wanna go for sure. Very friendly and inviting. We got there and the place was packed so we sat outside which wasn't bad at all with the skyscrapers peeking over at us :) Great beer selection, loved all the Belgians on tap, super pumped on that one. Anthony Kiedis looking bartender is very informative about the beers, polite, patient, and friendly, I knew he was the dude on the phone for sure. 5 stars for the awesome service, even the weirdo dude that walks around and asks if you're okay was cool eventhough he seemed like a creep at first cuz you can't tell he works there. Hah next time I gotta try the food!"
    },
    {
        "date": "2013-06-03",
        "rating": "5.0",
        "review": "My go-to spot in LA  I am a French Fries fiend! And Wurstkuche's double fried Belgian fries with truffle oil hit the spot every time.The sausages are good too. I normally stick with the hot italian, I like my food spicy and it's also one of the larger sausages.If you don't know what beer to grab, I suggest the blue chimay.Will come anytime I return to the LA area.I've heard good things of a place called the \"Salt & Cleaver\" that just opened up in San Diego, will go try soon."
    },
    {
        "date": "2014-02-22",
        "rating": "5.0",
        "review": "I cannot praise this place enough - Wurstkuche where have you been all my life?!5 stars for the fruli strawberry beer, the alligator and rabbit sausages, and the truffle fries with every kind of dipping sauce possible. I haven't tried many other types of brat's, but man oh man are the ones I have tried AMAZING. A small tip I'd give is to linger around in the seating area if it's crowded (which it normally is) - don't walk around looking for seating, you'll never find any! Just stay in one spot and you'll be a lot more lucky :)Please do yourself a favor and try this place - you will not regret it!"
    },
    {
        "date": "2015-03-14",
        "rating": "5.0",
        "review": "Really yummy Brats."
    },
    {
        "date": "2014-02-16",
        "rating": "5.0",
        "review": "I just love this place.  Fantastic sausages, great vibe, tasty beer, amazing fries, delicious dipping sauces, and reasonable prices.The seating can be hectic, but for some reason it doesn't annoy me like it does at other places such as Father's Office.  I think that's because if I'm ordering sausages and fries, I don't mind jostling about for a seat (as opposed to Father's Office where one orders pricier \"nice\" food and yet is still required to battle it out for a table like a barnyard animal at the trough).Just go and enjoy.Do expect a ten minute+ wait to order.  Sorry."
    },
    {
        "date": "2013-01-31",
        "rating": "4.0",
        "review": "Late birthday meal from my friend :)I finally got a chance to try this place even though I've been eyeing this place for a while. Since it was my first time I wanted to try a \"regular\" cut of meat first before I tried anything exotic. So I tried the bratwurst with sauerkraut and caramelized onions, with the large fries! Accompanied with chipotle aioli, and sun dried tomato basil mayo I wanna say. I didn't care for the sun dried tomato mayo so much, but the chipotle one was pretty tasty. I really liked the huge ass condiment bottles on each table. The honey mustard was really good, I straight up dipped my fries in it. The whole grain mustard was really prominent but the flavor was really good too. But hands down dat honey mustard would taste good on anything. My friend got the kielbasa with sauerkraut and caramelized onions, as well. I felt like a total goober not knowing about the huge patio seating. I had to wait for the a customer to tell me there's more seating in the back. I'm an idiot. But anyway, we finally get our food and everything paired really well together. I wanna go back and try the fancy sausages and not just stick with something so plain. But, the service was very friendly and I like that there is water on hand, and actually in glasses. I kinda just want more of their fries right now with honey mustard, chomp chomp munch munch."
    },
    {
        "date": "2013-12-21",
        "rating": "4.0",
        "review": "Most hipster joint I've been to for eating brats and fries, buttttttt I did not mind it. I know, I'm a changed person. The atmosphere was great and I loved the layout of the big back room with communal tables. I noticed there was a table for spinning. Geez, Party with brats and fries??? yes please. The fries were bomb. We got the pesto mayo and chipotle aioli. I liked the pesto mayo better. For brats, we got the mango jalapeño topped with sauerkraut and sautéed onions and the regular brat with sautéed onions and sweet peppers. Both were good, but if I could change oneeeee thing, it'd be for my mango brat to not be as sweet. Everything else was deeeeelish. If I didn't live so far, I'd definitely come back often to try every single brat and dipping sauce variety. Mmmmmmm fries.........."
    },
    {
        "date": "2013-03-18",
        "rating": "4.0",
        "review": "This place is set up right in art district where it belongs! ^^ If you like sausages this is the place for you. They have anything for classic sausages to exotic sausages. I ordered the DUCK BACON WITH JALAPENOS, and it was sooooooo good! I would definitely get that one again. Along with that I ordered the BELGIAN FRIES with Bleu Cheese Walnut & Bacon, and Chipotle Aioli. Soo good. The dipping sauces reminded me a lot of Pomme Fritts in St Marks, NY. The experience was definitely a pleasure and I cannot wait to go back. ENJOY!"
    },
    {
        "date": "2012-11-06",
        "rating": "2.0",
        "review": "Came here with a bunch of people after photographing the graffiti arts area. I've been to the one in Santa Monica and was hoping that this site might be different. Well, it's still the same. Same menu, same ordering/seating arrangement and unfortunately, the same indistinguishable sausages. This time I didn't try the rattlesnake/rabbit or the crocodile/pork sausage but opted instead  for something less exotic. Ended up ordering the Mango/Jalapeno (Chicken & Turkey). Well, too much of my chagrin, once again, you can't taste the mango nor can you discern the chicken and turkey. There is a hint of spiciness but the jalapeno flavor is no where to be found.Sigh. Why this place is rated so high is beyond me. For those of you who enjoy coming here, by all means keep on coming. As for me, I've had enough..."
    },
    {
        "date": "2012-11-10",
        "rating": "3.0",
        "review": "I didn't know this place was so hyped. My friend took us here for lunch after we went biking around Santa Monica Beach. We went on a weekday so parking on the streets was easy. And from the walk, we saw pretty cool graffiti on the wall. There was barely a line so we quickly got to order. I felt in an 'exotic' mood so I ended up getting the rattlesnake and rabbit.VIBE/PLACE:+very minimal style decor+/- the sausages are displayed but don't look too appealing+menu is very straight forward+ there is a hallway to the right of the register. It seems kind of hidden, but you go down the hallway and there's lots of seating (reminded me of a cafeteria kind of haha) and also an outdoor patio as well+sort of had the hipster vibe+met two nice guys and talked about occupyLA with them and the LA scene hahaFOOD/SERVICE:Ordered the RATTLESNAKE & RABBIT because one of the reviews said it was juicy and flavorful+the person I ordered from suggested the two toppings (caramelized onions and sweet peppers) for me and followed his recommendations+it wasn't too busy when we were there during the weekday so it was nice and mellow. Got to collect all the different mustard bottles and put them on our table :P+they bring your order to you and it was really quick.VERDICT:I honestly wouldn't know how rattlesnake/rabbit would taste like so everything here is based on their integrity right haha. Although I didn't have high hopes for the hotdog, I was still a little disappointed because the sausage wasn't as flavorful and juicy as I would like. Basically all I could think of was \"meh, it's ok, but hotdogs really are just hotdogs\"..... except I think dirty, greasy, juicy dogs or hot dog stands outside a club after a night of drinking and dancing are the absolute bests!I would come again to try out other hotdogs though. Their concept is still pretty neat. Also their bar looks awesome and I would like to try out their drafts."
    },
    {
        "date": "2013-01-07",
        "rating": "5.0",
        "review": "The five-star rating is for the fact that they have three choices of veggie hot dog.  I usually feel extremely lucky if there is ONE choice... let alone three (apple sage, Mexican chorizo, and Italian).As for the taste of the veggie hot dog, it's definitely a step up from those \"Light Life\" dogs... I think they are Tofurky or Field Roast quality.  I had the Italian with sauerkraut and caramelized onions.  Most of the mustards on the tables were too spicy/yucky for me, so I went with plain yellow.  The bread is not the typical soft hot dog bun, but I think that is because some of the combos are heavy and need a stronger bread.The husband got the rattlesnake and rabbit version, and I couldn't help but try a crumb.  It was completely different from anything I've ever tasted... if you're feeling adventurous, go for it!They also have a lot of interesting soft drinks to choose from... cucumber, elderflower, some sort of orange jigger... hmm."
    },
    {
        "date": "2014-02-17",
        "rating": "1.0",
        "review": "There's a good beer and sausage selection served with delicious bread.  Fries and dipping sauces were good too.  Unfortunately, while waiting in line, you will be barked at and harangued by an angry woman in charge of something for the first time in her life.  The words \"Please stand in the corner!\" were literally yelled at me.  Maybe put up a rope to guide the queue?  Otherwise, just build a little gestapo tower in the center of the lobby and give her a BB gun rifle to finish authenticating the german dining experience."
    },
    {
        "date": "2015-01-04",
        "rating": "4.0",
        "review": "I'm giving only 4 stars because of ups and downs of this visit lol. We got there around 4ish on a saturday , so we were able to find street parking, woooooo! As we entered , there is someone passing out little menus and taking drink orders since there's usually a long line. (FYI we were not greeted and the bf went to the front to get a menu, maybe the guy didn't see us when we walked in??) Once you're drinking your beer in line and place your order, they hand you a red triangle number thing to place on your table to spot you in the eating area in the back. We sat down and were entertained with the different sauces and the the fact that water was so yummy since it had a hint of cucumber. From there we waited ,waited and waited. Let's just say we saw a couple sit, get their food, eat it and left lol. At that point , we were ready to go to the front but one of the waitresses came up to ask about our food and came back to give us free fries because of the wait = we were content . 10 min after that our food arrives and the manager came over and took care of the whole bill and apologized which pretty much left us stunned. In conclusion , the fries are amazing, the food was alright but its all the different options that I think keeps people coming. That's one of the reasons I'm going back but taking care of the bill was so sweet of them and after waiting 45 min , they took care of the situation like superstars. Thank you sausage place I can't pronounce and I will be back soon!"
    },
    {
        "date": "2012-11-12",
        "rating": "4.0",
        "review": "You know that feeling when you take your first bite and your taste buds high five your brain ? like \"yes!!!!!!!!! you ordered theeee perfect thing!!\"The duck and bacon sausage with jalapeño is effing out of this world delicious!!!!!!!! It's just jam packed with amazing flavor and those caramelized onions and sweet peppers just made it even more yummy. Went so well with the spicy kick in the sausage.The Belgian fries are yummy as well... Get the chipotle aioli ! So good!!!Fruli is beer with fermented strawberry and that was bomb as well!Will definitely be back... I hate the dimness though"
    },
    {
        "date": "2014-03-14",
        "rating": "5.0",
        "review": "This place has quite the menu - rabbit, snake, alligator?? All sorts of strange animals in your sausages. I, the wimp, got the chicken sausage (menu lists it thusly: Sun Dried Tomato & Mozzarella - smoked chicken & turkey). I also got a Chimay White beer, since I'm a fan of Belgians, and it was a tasty combo. My date got a much more daring bratwurst, but I'm forgetting now (or selectively blacked out the memory, lol). Anyway, the atmosphere is cool in the back room, you'll enjoy eating your croc sausage and fries with a cold brew. I intend to go back and face my fear and try some rabbit sausage!"
    },
    {
        "date": "2013-03-14",
        "rating": "3.0",
        "review": "Vegetarian chipoltle sausage was pretty right on. The grilled sweet peppers were good as was the grilled onionsFries left a lot to be desired...add some special season salt on these bad boys to liven them up.Maybe come up with a special sauce; say maybe aioli blend?$7 is a Bit pricey for a dogNice seating layout; bench style"
    },
    {
        "date": "2014-01-04",
        "rating": "3.0",
        "review": "my meat loving mister demanded exotic sausage for his birthday, plus we were going to see the david bowie tribute band downtown, so wurstkuche it was. the interior is very urban loft chic, and i noticed a spin table with space for a dj.as for the comestibles, well, the mister loved his sausages, though i forget what they were, and the token vegan offerings were, as expected, field roast brand. what was not expected though, was the lack of a vegan bun for the sausages, and the selection of vegan toppings was pretty slim, especially if you compare this place to tony's darts away in burbank. i know, i know, you can't compare the two because one has the hipster location, while one is more ma and pa kettle. but you know, i like ma and pa kettle, so if sausages for the mister and his missus are one the menu, i say we go to tony's, where we both can be made very happy.i do want to shout out the fries, though. tres crispy, but again, tony's has homemade potato chips which are pretty outstanding!"
    },
    {
        "date": "2014-04-16",
        "rating": "5.0",
        "review": "I come here pretty often.. here's my usual, Duck & Bacon Sausage with Caramelized Onions and Sweet Peppers with a large order of their delicious fries with their blu cheese & Bacon dipping sauce.. usually i dont like blu cheese, but this dipping sauce is AMAZING!.. I also had their rattlesnake rabbit, gator, hot Italian, buffalo.. i basically tried a lot of their different sausages, but the Duck was my favorite. :) Also,  they have unique beers which is pretty cool cuz you can't really get it at a different spot."
    },
    {
        "date": "2013-12-28",
        "rating": "5.0",
        "review": "I would highly recommend coming to this place to eat if you are in the LA area. The parking is kind of difficult and weird but that might be because I came here around 10 PM. I was tight on money so I didn't get an exotic dog and went with the gourmet Filipino Maharlika--it was hands down delicious. My friends got the duck and bacon, rattlesnake and rabbit, and crocodile and pork which are all on their exotic menu; all three of those were pretty good too so I don't think you can go wrong with any of the sausages they have here. Read the description on the menu--it helps.Aside from the sausage we also got fries with curry ketchup and pesto mayo. 75 cents each which is a bit pricey but we didn't even use all of it...should have put some on the hotdog. The curry ketchup is alright and the pesto mayo is a must try if you are a pesto lover.You order in the front which is well lit but you eat in the back which is a club-like environment. There are hardly any lights in there but it is manageable. If you want to take a picture for instagram then go to the front where there is light. Not sure if it is like this during the day (probably isn't). There is also loud music playing so you can't really talk to any of your friends. Regardless I'm still giving this place 5 stars for the amazing meal and I rarely give 5 stars."
    },
    {
        "date": "2011-04-27",
        "rating": "4.0",
        "review": "If a hotdog and a hipster had a baby, it would shoot out of the womb and transform into Wurstkuche. Seriously, this place is pretty amazing.PARKING: Street parking, or you can try to snag a spot near Novel Cafe. Don't even try to park in the Office Depot parking lot 'cause you WILL get towed. There's plenty of street parking, so your only worry is if you suck at paralleling. FOOD: I ordered the Duck with ___ (I forget!), large order of belgian fries with pesto mayo and bluecheese bacon walnut (did I mix up the order?). My friend went with a good ol' bratwurst, but both were delicious! The bun was nice and toasted to perfection, and the sweet onions and hot peppers complimented the hotdog very well. I also exercised my 21-ness (YES!) and ordered the Forest Apple Ale. DELICIOUS. It tastes like a grown up's apple cider. Total cost of the meal? ~$19 Not so excited about that, but hey, that's life.ATMOSPHERE: Order first, then wait for your food while you drool staring at other people eat. The place is full of long tables but also has a couple of small tables lining its walls. Great for both large groups and cute hipster dates.SERVICE: Everyone was super nice and attentive, not that they needed to be. Everything is laid out for you (ketchup&mustards). Perfect for a late night meal or if you want to chill and grab a beer. Love it!"
    },
    {
        "date": "2013-12-16",
        "rating": "4.0",
        "review": "Excellent gourmet sausages. I was eating veg at the time and tried each of their more popular veg sausages - the Italian vegetarian and the apple sage vegetarian - both were excellent, and this is coming from a most of the time carnivore who likes really good sausages. From a flavor standpoint, they tasted like authentic meat sausages, which is unprecedented in my book. I did sweet peppers and caramelized onions on both and loved the combination. I will definitely be back to try all of the unique fare including the rabbit, rattlesnake, and the alligator if it gets put back on the menu (it was out at the time of my visit).The truffle fries were also exceptional, and pair perfectly with the curry catsup, which was the most unique and delicious take on catsup in recent memory. Round this out with a wide selection of craft beers, and we've got a winner. 1 star off for price, as I paid nearly 30 dollars for 2 dogs, small fries and a beer. Valet was $5, so that puts my meal into the mid $30 range.Honestly though, I can't blame them for charging what they charge - they can barely fight the demand off as it is, they deserve to be successful."
    },
    {
        "date": "2014-04-13",
        "rating": "3.0",
        "review": "$6.5 for a sausage is kinda rip off. Honestly the food here is not even that good. Id give it 2 stars but since the decor and cashier grl was super nice. I gave it a 3 star.Ordered the Santa Fe jack cheese sausage, sun dried tomato and mozzarella sausage and double dipped fries.Buns were not soft kinda tough to eat. Portion of the sausage was just the size of reg hot dogs you get at ralphs. The santa fe had a lil spice to it but wasnt tasty. Sun dried tomato and mozzarella sausage had a good flavor but not something to die for. Fries were the thick kinds w lots of potatoes but was a bit bitter. Curry ketchup was kinda unique. Pesto mayo is ok, nothing special.Did not try the beer. The location is hard to find parking fyi. I def wouldnt care to come back."
    },
    {
        "date": "2014-02-14",
        "rating": "5.0",
        "review": "Um, obsessed. Amazing brats and beer! Go, go, go and mingle!"
    },
    {
        "date": "2014-06-08",
        "rating": "3.0",
        "review": "Good sausages.   Enjoyed the selection of sauces.  Bread was real disappointment.   Atmosphere was more hip.  DJ played music. Fries were good.  Great place  for hotdogs if you live nearby, but not worth the trip from OC or Riverside.   Maybe if the buns were better."
    },
    {
        "date": "2014-01-07",
        "rating": "5.0",
        "review": "Parking is the only bad thing about this place. The fries are amazing (try the pesto sauce) and since I'm vegetarian I love that they have so many options for me to choose from. If you like beer like myself, you'll like their beer selection. I always leave extremely full! Be prepared to sit on long picnic tables, every time I bring someone they don't expect it. But they like it."
    },
    {
        "date": "2015-01-18",
        "rating": "5.0",
        "review": "We had the rattlesnake, duck, and polish. All were excellent with the duck with bacon most flavorful. Don't miss the outstanding fries with truffle oil! Spectacular!  Serves a large number of draft beers,  order a mug for a large beer otherwise it's a pint in a special glass. In the arts district which is interesting."
    },
    {
        "date": "2014-10-03",
        "rating": "4.0",
        "review": "Friends brought me here to celebrate my birthday. Excellent atmosphere. LIVE DJ set, awesome! Great service, good sausages and craft beer. I had the Sun Dried Tomato & Mozzarella smoked chicken & turkey sausage with a fries and a dipping sauce of Thai Peanut. For beer, I really enjoyed my pick, a Doppelbock called the Optimator at 7.6 ABV. The classic German dark beer, bottom fermented 'Doppel Bock'. Full bodied with a deep dark color and rich roasted malt flavor."
    },
    {
        "date": "2014-02-12",
        "rating": "3.0",
        "review": "Meh. The novelty wears off pretty quickly and you realize that Wurstkuche has overpriced beer and fancy hotdogs stuffed with random meat. My biggest gripe with the place is that they don't change out the beer offerings here. Don't get me wrong, the beer they have is good, but some variety and a rotating list would be nice. Also, the food is good but expensive. In my opinion you can get a better sausage somewhere else for a better price. But, if in the Arts District and craving sausage and beer, you can't go wrong stopping in here."
    },
    {
        "date": "2014-03-07",
        "rating": "3.0",
        "review": "I thought the hot dogs were good and definitely unique, but I felt like it was a little overrated."
    },
    {
        "date": "2013-12-28",
        "rating": "4.0",
        "review": "Is it weird that my favorite part of Wurstkuche were the dipping sauces for the French fries?  The ketchup curry sauce wen well with my bratswurst.  I also loved the chipotle mayo.  Yum!  I also tried a strawberry beer at the suggestion of one of the staff.  It was like a dessert beer  I would go back!"
    },
    {
        "date": "2013-03-04",
        "rating": "5.0",
        "review": "This place is a great hangout spot in Los Angeles near downtown. It pretty small and parking is difficult but well worth it. I tried two sausages and a few beers and everything was great. I am defiantly coming back here for more beer and food. There really is nothing to say that hasn't been said so come down and grab a brew."
    },
    {
        "date": "2014-06-02",
        "rating": "5.0",
        "review": "Loved the Bratwrust topped with caramelized onions and sweet peppers! A very traditional choice given the interesting and exotic choices on the menu. The fhick cut fries and a nice cold German beer made for a perfect meal."
    },
    {
        "date": "2013-12-24",
        "rating": "2.0",
        "review": "The latest dining experience at Wurstkuche fell pretty far from the level of excellence that I usually enjoy here.Thought this would be a nice place to start a double date in the arts district the other night...what could go wrong for a group of four friends expecting to enjoy great beer, craft sausage, and truffle fries with usually amazing sauces, right?Unfortunately, the food really fell short. Here was our order (and, please note, this order is usually EPIC, hence why we always order this):1. Bockwurst with caramelized onions and hot peppers= on this one, the bock was on point, but someone must have neglected the onions because they came out blackened (in the worst way possible). Had to wash the taste of burn away with a fair amount of Franziskaner, then scrape away the toppings, which essentially left a plain jane bock, which isn't as enjoyable.2. Mango Jalapeno with sweet and spicy peppers= luckilly we avoided the onion debacle on this one, but the sausage tasted undercooked or something, as the turkey and chicken inside seemed almost raw toward the center of the dog. This one was mine, so I made the judgment call to eat it, despite recommendations to send it back. 3. Duck & Bacon with caramelized onions and sauerkraut= onions were an issue here, so ditto to the explanation above, except substitute the Franz with the Berliner Weisse.4. Vegetarian dog with sweet and spicy peppers= not a problem with this one. Also ordered two large orders of truffle fries. Fries came burnt, and with wrong sauces. We had to send that back, and thought they would send new fries out right away...wrong. 30 minutes later, as we had been long done with the sausage situation and our beers empty, lo and behold came the fries.We'd paid for em so we took em to go, but the moment had truly passed.Hoping this was a fluke, but hopefully this gets resolved."
    },
    {
        "date": "2014-04-06",
        "rating": "4.0",
        "review": "A very nice hot dog / gastropub restaurant complete with some unique foods.Here are some must orders if it is your first time here:1) rattlesnake rabbit sausage - don't let the exotic name turn you away...its actually super duper delicious! plus, not everyone can say that they have had rattlesnake rabbit sausage. Definitely try, you will not be disappointed.2) duck bacon sausage - a good alternative, not as good as the rattlesnake, but still very savory and tasty3) Belgian fries in white truffle oil - do I need to say more? your tastebuds will dance in delight!4) Elderflower soda or Peach soda - top if off with one of these babies and you're good to go!"
    },
    {
        "date": "2014-06-01",
        "rating": "4.0",
        "review": "Love it, but help a brother out, take orders for people in line!I really like this place and always make sure to stop in when I'm in the area.  It's simple beer and sausages with great fries.  But the line can get more than a little ridiculous at times.  I've got a simple solution for them to keep the line moving.  Send someone out into the line to take peoples orders, write them down, give them the ticket and then when they get to the register all they need to do is present the ticket and pay.  This would move things along at least 25% faster.  If you've not been there before it's just a little confusing to order and what all the options are.  People get up to the register and take twice as long as they need to if they had their order figured out while waiting in line.  Simple"
    },
    {
        "date": "2015-07-14",
        "rating": "5.0",
        "review": "I admit that this place is a little pricey, but I always have to come back here because their sausages are sooooo good. I can't even think of any alternative to this place. It is that good. Go ahead and try ANY of their sausages and you will fall in love with it."
    },
    {
        "date": "2014-02-11",
        "rating": "4.0",
        "review": "Come here for some great sausage! Yummy. The choices range from familiar (bratwurst) to adventurous (rattlesnake). No matter what sausage and toppings you choose, you have to get the fries. They are delicious and hard to stop eating. They have a number of dips for the fries, though I always get the aioli. I'm drooling just thinking of it. In the back, there's a lot of communal seating and a huge bar. They have got a ton of beers on tap and they are glad to serve you samples if you ask. Try to go on an off-hour if you come with a group. It gets very packed with the downtown lunch crowd and around 7pm. Also, street parking can be tight."
    },
    {
        "date": "2014-05-03",
        "rating": "4.0",
        "review": "Love the food and the atmosphere here, especially how you can doodle on the paper sheets on the table with the crayons they provide around the last time I came 10 months ago or so.The only thing that's preventing me from giving 5 stars is the wait time, it's a great place with high demand so sometimes waiting in line to order or getting your order can take a while, but at the end of the day, it's worth it!"
    },
    {
        "date": "2014-01-28",
        "rating": "5.0",
        "review": "Not a huge fan of the hipsterness, but the food and beer are very good. Haven't tried any of the exotic sausages, but of the sausages I've tried, I recommend the following: Austin Blues, Bratwurst, Chicken and Apple, Filipino Maharlika, and Louisiana Hot Link. The only one I wouldn't recommend is the Bockwurst, because it's kinda bland and has an off-putting grainy texture, reminiscent of Oscar Meyer bologna.My favorite toppings are the caramelized onions and the sweet peppers, because they're flavorful, yet don't overpower the taste of the meat. Big selection of mustards. The whole grain, Dijon, and spicy brown are my favorites. The honey mustard has a funky taste to it...The fries and dipping sauces are fantastic! I didn't think I'd like the bleu cheese/bacon/walnut dip, but it is very tasty. My other favorite dips are the chipotle aioli and the curry ketchup. The only dip I disliked was the Thai peanut--I normally love Thai peanut sauce, but the ginger is way too overpowering in this one!Huge variety of beers and fancy sodas. If you want beer, I recommend the Franziskaner, Weihenstephaner Dunkel, or any of the Chimays. For soda, try the spiced apple cider. It tastes like apple pie filling, but isn't grossly sweet at all."
    },
    {
        "date": "2014-05-31",
        "rating": "5.0",
        "review": "What more can you ask for than a tall glass of beer, a juicy bratwrust in a warm bun topped with sweet onions and sauerkraut, and thick cut Belgian fries?   This is my go-to place when out of town friends come for a visit, and they always love it. Of course, it's easier to come when it's not peak hours, but despite the crowds at those hangry hours, I've been consistently impressed by the personable beverage service while in line. It makes the experience that much more enjoyable, and make the line out the door not seem so bad. Also, they're quite understanding of beer mishaps. I once had one of their plastic labels on their 5+ kinds of condiments fall into my beer glass, and they were more than happy to replace my entire glass no questions asked. That gets a gold star in my book. The only minor complaint I have about the place is the lack of seating and loudness, but of course, going at off hours makes it less of an issue. The long tables get crowded very quickly and you'll often find yourself in the company of strangers or squeezed at the end of the bench seat between tables or you'll have to wait a while for a free table, but I like the cozy atmosphere. I'd come here more often if I didn't need to watch my waistline!"
    },
    {
        "date": "2014-01-06",
        "rating": "4.0",
        "review": "I've been here a few times and I always leave happy.  They have a variety of sausages from typical to not so typical to vegetarian. I really like the mango & jalapeno sausage, which is turkey and chicken based. Their fries are excellent and the curry ketchup is so good! Good beer selection. You can go and just order beer and sit in the bar too."
    },
    {
        "date": "2013-12-02",
        "rating": "4.0",
        "review": "Pheasant and bratwurstwere very good, but buns sucked.I'll be back (won't rush)."
    },
    {
        "date": "2013-12-29",
        "rating": "4.0",
        "review": "What a FUN place, not just as a restaurant, but what has become a Downtown Landmark that leaves a good impression with every individual that pays a visit! A wide variety of sausages to try from, a fine selection of Beer, great service, a truly intimate Pub for friends and dates to enjoy, with the potential to get very loud and rowdy.I only been once and I ordered the \"Hot Italian\" & the \"Rattlesnake and Rabbit Jalapeño Peppers\" sausage. If I could have had a bite of every sausage, I would do it but my belly could only fit 2 on that particular day. I liked the Hot Italian a lot more as it was juicier/fattier but it was interesting to try the Snake & Rabbit combo. I don't remember what beer I got, but you can leave it up to the bartender to select a brew to your taste as you describe to them. You can taste it before ordering, and at a reasonable price. There are also bars within walking distance so it's safe to know you can have a full night out there.I recommend this to any lovers of sausages, beers, a fun experience and a place to take friends from out of town!"
    },
    {
        "date": "2014-02-28",
        "rating": "3.0",
        "review": "Meh, I don't get the hype. It's a hot dog with a lot of weird condiments, so that makes it gourmet? Not to mention pricy? No thanks. It wasn't even that tasty, I got the Austin Blues (I think that's the name) and it was aight, but my friend got the Filipino (or something along those lines) and it was gawd-awful, the odor of foul smelling meat just took over. Yuck! The fries were decent and their selection of beer is diverse and excellent, I'd go back just for the beer. The line is LOOOONG, too long for just an ok hot dog and some beer n fries. Personally I prefer eating those 'danger dogs' the vendors have waiting for you after last call! Lol, at two bucks a pop, they're damn delicious and worth the risk!"
    },
    {
        "date": "2014-07-13",
        "rating": "5.0",
        "review": "I plan eat rattlesnake and rabbit with onion peppers. I asked them for which one popular. Wow, over 5 k comments. Price seem not bad. Many option for hot dog and few non GMO. I ll challenge different kind of animals and sound fun. Recommend try it."
    },
    {
        "date": "2014-03-16",
        "rating": "4.0",
        "review": "I've never had such a interesting hot dog before.... or gourmet sausage on a bun. We shared one. We got a rattle snake and rabbit meat sausage. I actually enjoyed it a lot. Usually for me sausages have too much spices that it makes me bloated and makes me burp a lot. It did have that sausage kick to it but it was very light at the same time! Also ordered fries with it, and I had a Chimay. Sausage just goes so well with beer! Especially bold beer like Chimay. It was very dark inside, and since it was packed, it was hard to find a seat. We were lucky we found a small table. It can get very loud in there.Would like to come here again to try other sausages!"
    },
    {
        "date": "2013-10-15",
        "rating": "4.0",
        "review": "Wurstkuche is such a great place to go. There is always such a good vibe from this place. While keeping in mind that I dont drink, Wurstkuche is still one of my favs. The sausages are just mouth watering. Chicken apple is my fav. I also love all of the crazy types of sausage there too like rattlesnake and stuff. Oh and no trip to Wurstkuche is complete without truffle fries. And of course if you like beer than this place is for you.I love the large tables you share. It creates a very nice atmosphere. My only complaint though is that its one of the loudest places in LA and you are sitting there yelling the entire time. So not a good place for conversation."
    },
    {
        "date": "2012-08-17",
        "rating": "4.0",
        "review": "Gourmet sausages with exotic meats. What more can you ask for? This is definitely a hip and trendy spot in the arts district of LA. I happened to go on a night where there was a huge music festival going on, so the lines were ridiculously long. However, the servers move pretty quickly in taking your orders and moving the line along. I tried the Duck sausage. It was pretty good! Don't forget to eat it with some mustard! It really makes a difference. I tried some of my friends' fries. You must get the curry ketchup! You can't find it elsewhere!! The pesto mayo was pretty good as well. They have a lot of different flavors of bottled soda and different types of beer! This is definitely a chill place to enjoy some sausage and good beer with a few friends! Parking: There is street parking and lots around the area."
    },
    {
        "date": "2014-06-14",
        "rating": "5.0",
        "review": "Awesome food. I had the rabbit and my son Jr had the rattlesnake..delicious.trust me it's worth waiting in line. The dinning area is cool almost like a night club..they have a dj. Definitely going again. Oh yeah almost forgot ...they brought us some samples while we waited in line..very nice.."
    },
    {
        "date": "2014-01-19",
        "rating": "4.0",
        "review": "The parking is a nightmare! Just kidding, we got incredibly lucky and pulled in as soon as someone was leaving.The place is small at first and you stand in line wrapped around the building while an employee comes with a smile and a small, to-the-point paper menu. The menu is a bit intimidating with all these choices; what sausage do you want, what about toppings? Do you want a side? Oh now you have to pick a dipping sauce. But you'll need something to wash that german down. Now for dessert. Ahh I just want to try everything!After you order you take your number and go down a hallway that leads to a large dining hall with a bar! The lighting is very moody, kind of dim and romantic. They have individual tables or picnic tables all wrapped with butcher paper, and surprisingly clean! I was quite surprised with the environment and the food.THE POISON:Rattlesnake and Rabbit with Jalapeno Peppers topped with sweet peppers and caramelized onions.Rabbit, Veal and Pork Seasoned with White Wine topped with caramelized onions and sauerkraut.Side of groot (large) Belgian Fries with pesto mayo and sweet and sassy BBQ dipping sauce.Downed with Fruli (witbier fermented with strawberry 4.1% ABV).THE VERDICT:It was so delicious I am at a loss for words... I might be over exaggerating but it's how I feel! I was not disappointed and my excitement was rewarded beautifully.Though the only complaint was about my strawberry beer, it had a strange taste I couldn't quite wrap my tongue around... But it was still refreshing with the sausage.I want to come back to try more things and give a more specific review!"
    },
    {
        "date": "2014-11-06",
        "rating": "5.0",
        "review": "BEST BEERS ON TAP. I can not pronounce a single one...bet when I crave beer...this is where I come. Rattlesnake brawt is my favorite. I must say the set up of this place can be a little confusing so don't feel dumb when you order your beer, get it while waiting in line, then order your food and traverse a dark corridor to get to the back where the bar and seating is located. Its complicated, its hip, whatever cause its good."
    },
    {
        "date": "2014-08-16",
        "rating": "4.0",
        "review": "Good food but a little on the pricey side for just a sausage. Good beer selection."
    },
    {
        "date": "2013-11-03",
        "rating": "4.0",
        "review": "Stopped by to get some food before heading to a Lakers game! Ordering is quick, they have so many options...don't quite remember what we got though but it wasn't anything fancy like rabbit meat or alligator. BUT from what I do remember, it was delicious! Sauces were good. I loved the look and environment of the place. Still trying to find time to give this place another visit. Definitely did not disappoint the last time."
    },
    {
        "date": "2014-08-12",
        "rating": "5.0",
        "review": "During the weekends, line is out the door. However the truffle fries are worth it all. Best German beers as well as their sodas :) hot dogs .. Well let's just say. You can't  find them anywhere else :)"
    },
    {
        "date": "2014-03-19",
        "rating": "5.0",
        "review": "One of LA's delicious hidden gems right across the street from the Pie Hole. Has a wide array of sausages, some traditional and other on the more so exotic end, featuring snake and rabbit meat. I myself ordered the Rattlesnake and Rabbit, which was flavorful and juicy. No matter what you get it's going to be good, especially if you like sausage. Also order some fries with your sausage, which come with their own special dipping sauces (suggestion: get the sun-dried tomato sauce)."
    },
    {
        "date": "2014-04-22",
        "rating": "4.0",
        "review": "#rattlesnake hotdog#bockwurst hotdog are really cool, especially curry sauce for fries it's pretty awesome"
    },
    {
        "date": "2014-11-23",
        "rating": "5.0",
        "review": "Exotic. Rare. Gourmet sausages. Gastropub so beer options are on point. Try the snake.. Bratwurst. Hot Italian. Truffle oil fries. Vegan friendly. Great vegetarian options. Modern vibe. Open late."
    },
    {
        "date": "2014-08-04",
        "rating": "3.0",
        "review": "Overrated hot-dog spot. The line does not speak for itself. I understand the hype with all the different types of the choices of meat, but the food is not worth the hassle of waiting for seating."
    },
    {
        "date": "2014-02-14",
        "rating": "4.0",
        "review": "I keep coming to this place bc it's one of the most convenient restaurants for large groups. Get their fries! The pesto and sundried tomatoes dips are heavenly. I would skip on the truffle oil bc it's pretty flavorless."
    },
    {
        "date": "2014-08-16",
        "rating": "4.0",
        "review": "I've only had the duck from here which is super juicy and flavorful. The atmosphere is so relaxing and welcoming for families or friends grabbing a bite. The vast beer selection is definitely a plus!"
    },
    {
        "date": "2014-05-20",
        "rating": "5.0",
        "review": "Let me just say, I love the fries here!  There are so delicious, I usually get the kielbasa sausage and a strawberry soda. This place has a bar, it's dark and the ambient is great to hang out with friends or just have a quick bite."
    },
    {
        "date": "2011-04-12",
        "rating": "4.0",
        "review": "I love pinks hot dog and this is not quite the same but it was good enough for me!Toppings: Onions, Sauerkraut, Sweet Peppers, Spicy Peppers. You get to pick 2 toppings for your hot dog. I recommend onions & sweet peppers. I didn't like sauerkraut too much because it has no flavor to it, kinda plain?Buns: it's quite different here! They actually use their own bread so it was good! It's very soft which I like. It's somewhat similar to Vietnamese banh mi, but not quite.Classics Hot Dog: $5.75Gourmet Ho Dog: $6.50Exotics Hot Dog: $7.50- Austin Blues (hot & spicy, tri-pepper, hardwood smoked pork) for $6.50. I really like this one so do get it! The sausage was crunchy, and very flavorful- Bratwurst (fine cuts of pork, coriander, nutmeg) for $5.75. This one was a bit plain so I wouldn't get it again!- Belgian Fries: $3.50 for small. The fries here are thick but crispy still. I'm not sure is it supposed to be dark but our fries were a bit burnt? I only tried PESTO MAYO sauce with it so far and I like it! It's like mayo mixed with avocado or something (I'm just guessing)"
    },
    {
        "date": "2013-10-11",
        "rating": "3.0",
        "review": "In a nutshell, wurstkuche is pretty overrated. It wasn't bad, but it wasn't great either, and I don't quite see what the hype is all about. Food-wise: Very mediocre. It was an okay meal, I think when you keep hearing praises about a certain thing and you actually get to try it, more often than not you will be disappointed. Atmosphere: very very nice chill out place. Great for supper with friends or beer on a Friday night. Gotta love the atmosphere!Maybe I'll give it another try, maybe not. I don't see any reason to come back yet I don't see why I should ban it either. *shrugs*"
    },
    {
        "date": "2014-01-16",
        "rating": "4.0",
        "review": "Good food. Great beer. Awesome vibe. Very cool interior. Still digesting the fact that I spent that much on a hot dog and a beer."
    },
    {
        "date": "2013-08-27",
        "rating": "4.0",
        "review": "The venue is super fun. I feel as if they converted an old bar/club into a restaurant. There's a foyer where customers order. It appears to be a to-go place. However, you then take your number and walk down this long, dark hallway and emerge in the belly of the restaurant where there's cool music and filled tables. The music is very loud but not annoyingly so. We went late, around 8 or 9, so the \"nightclub\" atmosphere was appropriate for its apparently hip crowd. I think the atmosphere is what made this restaurant 4 stars and worthwhile. It's very suitable for younger people trying to get together with friends. The food was decent. There was a variety of sausages along with exotic meat. The fries were thick cut and came with a variety of dipping sauces (thai peanut, curry ketchup, etc). There were also mustard squirt bottles on the table for the sausages. For me, the experience was enjoyable because I was having a good night in general. I also got the Mr. Q-Cucumber soda which I enjoyed and everyone was screaming across the table to be heard. It was funny for me. Keep in mind, it's probably a whole nother experience during the daytime."
    },
    {
        "date": "2012-08-26",
        "rating": "5.0",
        "review": "I've been coming here for years. They have the best German Sausages and beer. Now that this place has become very popular, the line is always ridiculously long. I always bring my friends here to introduce them to the restaurant. It has a cool vibe. This is one of my favorite restaurants. You order in the front and take your food to the back where they have long tables connected together. They arrange the tables like this purposely so everyone is crowded together like in Germany. The crowd has gotten younger over the years. There's a DJ on the weekends so it's not a conducive place if your trying to get to know someone. My usual order is the Bratwurst with carmelized onions and sweet peppers. Their fries are delicious too. It comes with special dipping sauces of your choice. The chipotle aioli is one of the popular choices. I've tried their Duvel Special and a few other shots, all good. The average wait time for your food is 15 minutes - they start cooking it after you order. During rush hr is 20 mins."
    },
    {
        "date": "2014-06-21",
        "rating": "5.0",
        "review": "This is a great shop. First place I've been to that specialized in sausages. It's a little stuffy, but that doesn't bother me.Best after dark, and their fries are delicious."
    },
    {
        "date": "2012-09-21",
        "rating": "4.0",
        "review": "How is it that I have yet to review this place?!?! Shame on me. Love me some exotic sausages, and some yummy brews to boot?! Color me sold! Sure the lines can get pretty long on the weekends, but hey, it's just THAT good. If you hate waiting in line, come earlier. Simple as that. Now go get yourself a sausage and beer and stop yer complaining!"
    },
    {
        "date": "2012-07-31",
        "rating": "5.0",
        "review": "I hated hated HATED (notice it's in past tense) hotdogs after a bad incident of eating too many in second grade and... you don't want to hear the rest of THAT story. Anyways, when a group of my friends chose this random hotdog place ... I was NOT excited. Even worse, they could NOT tell me the name of the place... they butchered it every possible way. During the drive to Wurstkuche... I had extremely low, bottom of the barrel expectations of this place. The place is located in the arts district of downtown LA so it's a pretty hipster joint. The staff working there was super laid-back and there wasn't much of a line (at least when I went). I spent some time reading through the different sausages they had and it was all pretty interesting. The sausages range from classics ($5.75), gourmet ($6.50), to exotic ($7.50).  The exotic ones were toOOoo exotic for my liking... buffalo? alligator? rattlesnake? rabbit? All I could think was... ewwwwWww and wWHHAAAAaaa so I ended up ordering the chicken apple & spices with caramelized onions (a super safe choice and something I would recommend to first-timers) and belgian fries with sundried tomato mayo. Seating wasn't too bad, but I can imagine how irritating it could be if there was a long wait. Music was loud, lights were dim, and there were tons of people talking. I left Wurstkuche satisfied with the food and the experience as a whole. I recommend this place to everyone and anyone... hotdog lovers and haters alike!"
    },
    {
        "date": "2014-08-17",
        "rating": "2.0",
        "review": "Although the customer service was really good, the vegetarian chipotle was nothing special. Tie that in with a 7$ beer, well..."
    },
    {
        "date": "2014-02-11",
        "rating": "5.0",
        "review": "This place has freaking 5,000 reviews. I came in expecting Hipsterville overloaded with tourists... and it was.But... the Bratwurst was amazing. The beer selection is great, and it was a fun vibe on a late Friday night with pretty appropriate music. The service is friendly, and the place is trendy but comfy.Man... they got me. That's all I can say! If you haven't been this place is a must!"
    },
    {
        "date": "2009-04-16",
        "rating": "2.0",
        "review": "Meh."
    },
    {
        "date": "2012-11-09",
        "rating": "4.0",
        "review": "Like"
    },
    {
        "date": "2013-08-06",
        "rating": "5.0",
        "review": "Great!"
    },
    {
        "date": "2013-09-12",
        "rating": "4.0",
        "review": "yummay!"
    },
    {
        "date": "2014-01-24",
        "rating": "5.0",
        "review": "Bueno!"
    },
    {
        "date": "2014-02-09",
        "rating": "1.0",
        "review": "sucks"
    },
    {
        "date": "2014-04-08",
        "rating": "5.0",
        "review": "BOMB!"
    },
    {
        "date": "2014-04-23",
        "rating": "5.0",
        "review": "yum!"
    },
    {
        "date": "2014-05-29",
        "rating": "4.0",
        "review": "Delish!"
    },
    {
        "date": "2014-08-18",
        "rating": "4.0",
        "review": "Yummy!"
    },
    {
        "date": "2014-08-27",
        "rating": "4.0",
        "review": "yum"
    },
    {
        "date": "2014-09-13",
        "rating": "5.0",
        "review": "yea"
    },
    {
        "date": "2015-11-21",
        "rating": "5.0",
        "review": "YES"
    },
    {
        "date": "2013-08-12",
        "rating": "5.0",
        "review": "Pros: Unique sausage choices, unique beer selections, and amazing interior design.Cons: The price and wait.Food Experience:We got there for lunch time around 1pm on a Friday Aug. 9th. It already had a line and I was kind of bummed out but we stayed. We received a menu from this british employee. The prices were sort of high for a \"hot dog\". I got a beer and it was malty and delicious. So we ordered and the wait was not long. I ordered under the Exotic Section of the menu and got the lamb, rattlesnake and the duck. They were all delicious with Spicy pepers and carmelized onions. We also got the large fries but it wasn't even that big. They were big fries but not a big portion. They were delicious with the big selection of unique dipping sauces.Conclusion:Yes I would recommend anyone to come here. It was a great experience. Bring hella money lmao get two wursts hahaha."
    },
    {
        "date": "2013-08-02",
        "rating": "5.0",
        "review": "I love me some exotic sausages! You get kind of hesitant to bite into one made of rattlesnake and rabbit, but when the time actually comes.. you're happy you did! :D hahahh the sausages are always juicy and delicious! You can add toppings of your choice as well! I love their beer selection and how they carry Chimay! :D one of my favorites! It is all self-seating in the back of the place! A kind of trendy picnic, cafeteria type feel! This place is awesome! Somewhere different to try out!"
    },
    {
        "date": "2013-09-20",
        "rating": "4.0",
        "review": "If you can't make up your mind, you'll hate this place. Dizzying sausage choices, and killer fries and three choices of dipping sauces including an aoili.I liked it."
    },
    {
        "date": "2014-09-30",
        "rating": "5.0",
        "review": "Fantastic selection of Belgian and German beer. Fantastic food, awesome fries, and an overall really cool vibe. This place gets packed on the weekends. The tables are cute in the dining room, and there is  a dj there occasionally. My favorite spot off of Alameda."
    },
    {
        "date": "2014-02-04",
        "rating": "3.0",
        "review": "If you are into very trendy dark bars with hip DJ sets mixing as you eat interesting sausages this place is a must go.Beer selection is okay."
    },
    {
        "date": "2013-10-05",
        "rating": "5.0",
        "review": "Würstkuche... Because every chic needs some sausage in her life.Sausage, anyone? This incredibly cool restaurant/lounge is the bee's knees.  Nestled just beyond Little Tokyo on 3rd and Traction (plus a newer location in Venice), the menu boasts an impressive list of gourmet sausages and hot dogs.  From rabbit to rattlesnake, duck to sweet pork, this place is the place for a casual dinner with the girls or a laid-back date with your guy. What's more, not only does the place have crazy good food, it also has an insane selection of beers. From the German Reissdorf Kolsch to my personal favorite, the Früli, an amazingly sweet strawberry beer, Würstkuche is one of those downtown gems that you'll certainly thank me for turning you onto.Insider Tip -  Not a meat lover? Würstkuche is still your place as it offers vegan options such as the Vegatarian Smoked Apple Sage. A tasty combination of apples, Yukon gold potatoes, and rubbed sage, it's absolutely delish."
    },
    {
        "date": "2014-09-07",
        "rating": "5.0",
        "review": "love this joint, great selection on beers, dogs and great delicious fries.  I go here with my buds to play Catan weeknights and just eat and chill."
    },
    {
        "date": "2014-10-14",
        "rating": "5.0",
        "review": "Crazy selection of meats...but there are plenty of beers to pair them up with as well. Nice, chill spot to hang out as well.  It's a spot that is hard to miss, you can easily pass it if you're not looking for it.  Always had great service and food has not disappointed me."
    },
    {
        "date": "2014-10-30",
        "rating": "5.0",
        "review": "First of all: the communal seating is a touch of genius. If you can tolerate the wait in line to order your food, the sausages are universally good. Plus, what can you say bad about the sheer quantity of Belgian ales on tap? I know the rattlesnake and rabbit sounds cool, but you really should try some of the other varieties too.  Prices are of usually decent value, given the quality of the sausages and Belgian ale offerings. Don't think I forgot about the Belgian fries, either."
    },
    {
        "date": "2013-07-30",
        "rating": "5.0",
        "review": "I love this place Cool locationGreat Atmosphere (gets really packed) the hot dogs are something else! MUST TRY!!Good variety of draft beer Ive brought friends here they were amazed."
    },
    {
        "date": "2011-03-19",
        "rating": "5.0",
        "review": "Hands down! Best Hot Dog i have ever ate in my life. I barely compliment places, but this place truly deserves a 5! This place not only deserves a 5 for their food, but along w their service and ambiance. Things i tried: Belgian Fries Mango Jalopeno Hot Dog w carmelized onions and spicy peppersDuck Hot dogFranziskaner BeerFries: crispy and fried to perfection. Very addicting with the chipotle sauce. Mango Jalopeno Hot Dog: Most juicyest and tastiest hot dog ive ever tried! Duck Hot Dog: This was alright to me. The mango jalopeno hot dog was better Franziskner Beer: Tastes like Heffenwizen but a lot better.Does not need any oranges and does not have any bitter taste to it. This beer is a must have!Entrance: Long line, but goes by quick. Great service w workers asking if we need help with the menu. Looks like a small hole in the wall but when you walk in there is a long hallway that leads you to another seating. Live DJ with GREAT music, very hip and kind of reminds you of a cafeteria but instead a modern one. Very Dark, may need some more lighting. Self serve water. Another bar inside. Very fun and live atmosphere.Overall Experience: GREAT! This place is way better then Pink's Hot Dog. Everyone who goes to LA should definitely try to place! 5 stars all the way!"
    },
    {
        "date": "2014-03-06",
        "rating": "2.0",
        "review": "I like brats. I like sausages. Exotic meats? Sure! But I'm a bit disappointed. They were just fancy sausages at a higher price. I didn't really feel like I had anything special."
    },
    {
        "date": "2014-08-24",
        "rating": "4.0",
        "review": "I really like the food and beers at Wurstkuche and I think they do a great job of managing their line, bringing you your beer order as soon as you're inside the door. My one big problem is that in the evenings they BLAST music. You can't hear the people in your party without yelling. It's not a club, it's dinner, why make it so hard to carry on a conversation?"
    },
    {
        "date": "2013-12-07",
        "rating": "3.0",
        "review": "Mango Jalapeño & Chicken Apple sausage: slightly charred, but good with bbq sauce. MJ: spicy, mango cubes with shaved jalapeño CA: small, but comes with 2All in all: over done on the outside (probably cooked on high heat for a shorter wait)For the price: the music is nice"
    },
    {
        "date": "2014-07-10",
        "rating": "5.0",
        "review": "Waiting in this long ass line with one register open thinking to myself \"this better be worth it\" and oh boy it was!! Me and my boyfriend both got the mango jalepeño with the fries! Hands down the best hot dog I ever put in my mouth. Definitely coming back soon for some more of this goodness!"
    },
    {
        "date": "2014-01-02",
        "rating": "4.0",
        "review": "Good beer, great sausage and fries, hard not to like if those two things interest you!The space is also relaxing and interesting in a very Arts District/DTLA kinda way. Usually good music playing too. I always enjoy coming here, and the line usually moves pretty quickly (which gives you time to decide on your beer selection!)."
    },
    {
        "date": "2012-07-03",
        "rating": "4.0",
        "review": "The fact that i make frequent trips to Wurstkuche shows that this place definitely deserves 4 stars.. the variety of sausages they have is immense.. and their selection of beers is even greater.. my favorite all time is the rattlesnake and rabbit.. i usually add the hot and sweet peppers as my two topping choices.. plus their fries and sauces are delicious.. the curry ketchup is a pretty unique flavor that we always order.. the others are good too but i can't think of them off the top of my head.. i know for sure i've tried the greek, aioli, and the bbq.. all good.. their collection of mustard at the tables is awesome too..the great thing is that they now have a location near venice so its really close to my apartment. woot"
    },
    {
        "date": "2012-07-22",
        "rating": "5.0",
        "review": "YES PLEASE YES PLEASE ALL THE TIME EVERYTIME.Yes.. hits the spot always. Never fails.Every possible sausage with every possible mustard.. mmmmmm the spicy mustard is DELISH.Gimme some awesome aioli with my belgian fresh hot fries and Im good to die in heaven.Super fun trendy hip spot ... and even though it's packed 25/8, the service is supreme - kudos to those hard workers! lovely lovely energy without trying too hard."
    },
    {
        "date": "2012-07-29",
        "rating": "5.0",
        "review": "The popularity of Wurstkuche's sausages is one of it's main drawbacks. We waited in line 45 minutes on a Thursday night to place are order. There a slight reward is your position in line moves from outdoors to indoors as on that threshold you're allowed to order and enjoy a beer. Come with friends to enjoy your time in line.You CAN skip the line for sausages and other food and head directly into the bar or outdoor patio if you're simply drinking. Another tactic to deal with the line for famed sausages is to send the bulk of your group into the bar and rely on 2 volunteers to wait out the line for sausages.IMHO the DJ needs to pump down the volume to promote conversations amongst friends seated at thee table.Yes, with all those airings of grievances Wirstkuche comes through with a five star rating.The reason is you am not easily find their gourmet or exotic sausages elsewhere. My family enjoyed the following:* Alligator and Andouille* Rabbit and Rattlesnake with jalapeño* Duck and baconAll excellent and exotic. My favorite was the Rabbit and Rattlesnake.Erin called the fries the best she's everhad. Amply wedged from potatoes and twice fries - be sure to select most tempting dipping sauces when you order.The beer list of Belgium and German draught and bottled beers numbers in the dozens."
    },
    {
        "date": "2013-06-23",
        "rating": "5.0",
        "review": "Wurstkuche is no normal place to get classic German sausages. Skip the temptation and go for the gold: exotics. This is one place where trying rattlesnake, crocodile, and rabbit wont get you regretting it. You may get funny reactions from your mother who heard you tried it (she asked if I was eating animals at the zoo--silly mom), but it's definitely an adventure worth taking. Food: - Rattlesnake & Rabbit ($8): Definitely dont taste the rattlesnake or rabbit, but you know in your mind that it's in there...somewhere. This was actually a fantastic choice. The sausage is plump and juicy with a mixture of jalapeno peppers which gives it a light and buttery feel with the whole dog. It was the best out of the ones we tried. Definitely recommended if you want to really spook your brain but realize it's not bad at all.  - Crocodile & Pork ($8): This sausage is a bit longer in length from the others, but honestly it's a bit drier. The thicker casing gives it a nice resistance to each bite, but it also doesnt make it as juicy since the dog itself was missing some flavors you would hope to have. Like the other exotics, you cant taste anything funky. I probably wont get this again because of the lack of intriguing texture and flavor that I was hoping for. - Austin Blues ($6.5): We chose this because my brother and I were from Austin, so I guess it kind of worked well. I loved the smokey taste to the dog that encapsulated the pork that it was made of. The slight spiciness was not that distinct, but it did bring a hot texture that made it enjoyable. Flavors were flowing and definitely not dry. It was great but not a top choice for me. It was, for a lack of better words, safe. - Fries with Truffle Oil: Honestly if you havent tried their normal fries, there's nothing to compare this with. It did have a slight hint of the oil but honestly it wasnt anything in specific. They were large-cut fries with a generous flow of cooking oil. Nothing impressive but it did go very well with the dogs.Pros: - Gastropub feel and noise level. Definitely gives that kind of ambiance - Clean and efficient service even though it takes a while to get through the line! - Location is in a bit of a hipster-progressive neighborhood. You can totally feel it.Cons: - A little bit expensive for my taste. $8 for a dog is not my ideal price range, but it was great for what it was. - The lines can be insanely long. like looping around outside. Be careful. I suggest calling before you head over (which really did help) - Parking is tricky since there's no designated parking spot. Finding a spot on the street may be a little tricky.The nonadventurous side of me had its quota-fill for the month. No more crazy foods for a little while, but definitely it was an experience worth documenting. And it's worth coming back to...I'll be back!"
    },
    {
        "date": "2014-10-27",
        "rating": "3.0",
        "review": "I like the vibe but I am not a huge fan of un-healthy food! So, I might try this place again but definitly not more than once is a year or so!"
    },
    {
        "date": "2014-07-31",
        "rating": "2.0",
        "review": "This place is overrated. Food was okay. I expected more. I wasn't able to try their beers, I was the designated driver that day. I might come back again and give it another shot."
    },
    {
        "date": "2014-08-18",
        "rating": "3.0",
        "review": "Cool little dark place to hang out, i like the big tall glasses of beer, but honesty i went in there thinking this place must be bad ass everyone talks about their dogs being so good i thought the ones i tried were ok."
    },
    {
        "date": "2014-10-10",
        "rating": "5.0",
        "review": "This place is pretty dark when you go at night. Also there is not much parking available. Other than that, I cannot say enough good things about their food! I always loved a good bratwurst and this place is simply the king. Make sure you try the rattlesnake with a side of fries!!"
    },
    {
        "date": "2014-02-27",
        "rating": "5.0",
        "review": "I have come for quite some time and never took the time to write a review.   The other night I dined here w my bf and our order was short one hotdog.  Apparently the cashier didn't ring it up,  not a prob I was willing to head back to the line and order again but Sean the server said it was on the house he'd take care of it !!!! Wowee ....I was impressed with how he offered to correct the misunderstanding.. I love the atmosphere here ..really chill, great food and drinks and the customer service is on point.  Thanks guys !! Well be returning often"
    },
    {
        "date": "2014-09-26",
        "rating": "3.0",
        "review": "Just A-OK to me.  The price isn't that great for what you get as far as I'm concerned.  Whenever I get a sausage here I'm always kind of let down.  Good, but not great like many claim as far as I'm concerned."
    },
    {
        "date": "2013-06-09",
        "rating": "5.0",
        "review": "I yam zee absolute wurst at zees tings! Vraiting reviews dat ich. I cahn nevuh figure out vai I ahlways put zem off, but for dis place...dis place icht gut. I vrait da review vraight a vay! To quote mein friend, zees sausages \"quite frankly, brät us pure joy.\" Now before we get into a swordfight over which sausage brät it's a-game to my mouth, I *must* disclaim that I will be updating this review every time I visit. It's obvious this guy can handle only so much of a sausagefest before tapping out, so I'll be going to take them on, one at a time. I'm not leaving LA anytime soon and we all know Wurstküche AINT never going out of bitness anytime soon, neithers!Upon my first visit to Wurstküche, I was overWelmed by the sheer variety they offer. It was a meat market in there! I'm surprised they didn't have someone working the mop and bucket, cleaning up everyone's drool. Yes there is a line. Don't be a dick and cut! Wait your turn and you will be rewarded with glorious meat tubes. The cashier and the beer lady were extremely pleasant and I like that about places like this. There are no pretentious asswipes here. Even the runner/buss boy gave a me wink when he handed us our food! Hay! Good tip for all of y'all! Although everyone fawns over the Rattlesnake, Rabbit, and chipotle link, I wasn't going to bend over backwards to get it...I was going to let my instinct decide what I was going to have...in general, I need to let my gut decide what it wants me to do every time. It has never been wrong and I need to believe in it more and you do too! Stop being a wiener and believe in yourself...it'll do you some good. Anyway, it decided that pheasant and herbs de provence was what it wanted...topped with caramelized onions and sweet peppers no less. WHOOOOO-WEEEEE! Am I a phucking phan oph the pheasant dog.I bit that brät and honest to God, it bit me back with an explosion of flavor. This tubesteak was absolutely the best cylindrical item i've tasted to date. Fennel and thyme are superb herbs and compliment pheasant meat (which is similar to chicken and possibly turkey). It also paired VERY WELL with my Reissdorf Kölsch draught. Light. Crisp. Excellent with any of the other \"white meat\" sausages. (My friend and I pointed out the veal sausage and how it was like the albino brät. It just stood out among the rest with its pale (lack of) color. o__o) In addition, my friend and I split a \"Groot\" cone of the twice fried Belgian Frites and two dipping sauces...the Chipotle aïoli and the BBQ. Both are amazing..In fact, I would even suggest ordering an extra of the BBQ to go with the Austin Blues brät. These fries were down right delicious and worth every sinful calorie. I don't care what you say, these are MANDATORY.Sigh, until we meet again Wurstküche...I will be dreaming of your meatpoles...every...day...and...night."
    },
    {
        "date": "2014-08-19",
        "rating": "2.0",
        "review": "Overpriced hipster hangout.  The sort of place where young, materialistic hipsters flock to so they can flash their money around and impress their friends.  The sausages were good but not worth the highfalutin prices.  The selection of beers is the best thing going about this place, but beer is also overpriced here.  There was a lot of douche bagness going on in the joint, too.  I hadn't heard as many cheesy pickup lines from guys I'd never go out with even if they paid me since my freshman year."
    },
    {
        "date": "2010-08-16",
        "rating": "4.0",
        "review": "This place is a nice place to go for your sausage and beer fix. The atmosphere is great and friendly and the food is pretty good.When we went inside, we basically ordered what we wanted at the front cashier. Then we took our sign to the back of the restaurant and sat down in those long long tables. So in a way, it's not like, you sit down and wait for your waiter to take your order.... it's more like fast food etiquette but classier. The restaurant itself was pretty modern and hip, and I liked the idea of the long tables. It seemed like a nice place to talk with people sitting nearby you. Also there are small tables, but those are very limited and most likely already been taken, and there is also a nice bar. You also can get your ice cold water, self serve... and also pick up your utensils and napkins next to the water jug.The food... I got a Louisiana hot link with carmelized onions and sweet peppers. Also got belgian fries with pesto mayo, and I also got a Fruili Beer (beer fermented with strawberries). Overall the food was really good. I was more surprised on how good my pesto mayo tasted... that was bomb. Also the sausage was really well made as well as the belgian fries. The fruili beer was good... but $8 for such a little amount... uhh....Overall, my experience was pretty good and I will definitely come here again."
    },
    {
        "date": "2012-10-25",
        "rating": "4.0",
        "review": "Good hot dogs. Good fries. Really good beer. Pricey. Definitely a hip place to eat at.If you go with a big group, make a reservation. Otherwise, you're shit out of luck finding a table for a group of 3 or more during the night.I was on the fence between 3 and 4 stars only because the street parking really sucks and the wait is pretty long as the line will go out the door and onto the sidewalk, and the seating area is limited and finding a table is a pain in the assParking: Street and it sucksPrice: $15-$20 per personWait: 15-25 mins in line then for the food to come out"
    },
    {
        "date": "2014-04-27",
        "rating": "5.0",
        "review": "Ate here for the first time, bomb had the Louisiana hot dog with peppers, onions spicy mustard and the ketchup 5/5. Blue cheese with the fries amazing. It was packed with a dj on  a Saturday night, deff the spot to catch before a dodger game. This would be a great place for a craigslist meet up"
    },
    {
        "date": "2011-02-26",
        "rating": "3.0",
        "review": "Not worth the wait at dinner but awesome for lunch (or when the wait is less than 10 minutes).  At night, there tends to be a line as long as a Disneyland ride.  I don't find the wait does the justice.  What is with these people in LA waiting ridiculous minutes for a sausage?  Although, this place is a notch higher than Pink's.  The sausages are pretty good but not wait 30+ minutes good. Seating is not assigned.  They have adopted the \"go to a bench and eat\" mentality like at Oktoberfest or lunchtime in grade school.  When it's busy, this can be troublesome.  I suggest sending a friend to find a table while you wait in line if the place is pretty happening. Your sausage is served with the choice of two of the four options:Caramelized Onions: They are good.  I ask them to go light on the onions as they can be a bit overbearing.Sauerkraut: Bring it!  I love this stuff.  How can you not have sauerkraut on your bratwurst?Sweet Peppers: not a fanSpicy Peppers: not a fan, but better than the sweet peppersTheir gourmet mustards are also great: Whole Grain, Spicy Brown, Honey Mustard, and American Yellow.Bratwurst: fine cuts of pork, coriander and nutmeg.  Really good.Filipino Marharlika: sweet prok, natural seasonings.  When I read this I was thinking longanisa, but it's not.  But still really good.Rabbit, veal and pork seasoned with white wine:  like the description, it's light and delicate.  They forgot to mention DELICIOUS!Their Fries are good too.  It's really good with their buttermilk ranch.  I don't really care for their other sauces especially their ketchups, but the tzatzik is new and looks enticing.If you want to try the a German Pilsner: Spaten is light and is really good with bratwurst.Enjoy!"
    },
    {
        "date": "2014-10-08",
        "rating": "5.0",
        "review": "I nnneeeed to go back to this place it is so f-ing delicious! I am a vegetarian so their veggie sausages won my heart. Especially the spicy tofu with fajita veggies! Yum yum!"
    },
    {
        "date": "2014-08-02",
        "rating": "5.0",
        "review": "Great selection of beer, awesome selection of food and a good atmosphere for just hanging out.  It can get crowded and thus a bit noisy but I really enjoy the vibe this place has.  I feel comfortable having a drink here."
    },
    {
        "date": "2013-10-09",
        "rating": "5.0",
        "review": "Love this place. Beer, fries, beer and sausages. Great spot to have a fun and relaxing lunch. Can't go into details now. Suffice it to say you can't go wrong if you like all 4 of those things. Cause that's all they have. Enjoy.This is now one of my favorite spots to take out of town clients for a fun lunch!Thanks for making this place so rad."
    },
    {
        "date": "2013-08-12",
        "rating": "4.0",
        "review": "I've been here twice and tried their \"exotic\" sausages. I tried their rattlesnake and alligator sausages and they were very flavorful! The alligator was a bit chewier than the rattlesnake but it didn't stop me from finishing it. And the atmosphere of the place was very hip and cool. Plus, I love that their water in the back has a hint of cucumber in the taste!"
    },
    {
        "date": "2015-02-17",
        "rating": "4.0",
        "review": "Great atmosphere amazing selections of food and beers,Very up beat.The only negative point is for, if you ordered and already seated and want to order more food you have to stay in the line even you have a table inside. Other than that well worth the try."
    },
    {
        "date": "2014-04-25",
        "rating": "4.0",
        "review": "Es good! Large selection of german beer. The sausages are yummy and you have a lot of sauce choices for fries. Only two complaint are 1.) that its always packed and can be hard to find a seat if you're with a large crowd. 2) people who leave their mess when they leave. It's hard enough getting a seat then you have to wait for a busser to come and take some slobs trash. Overall, food is good and goes down great with a nice refreshing beer."
    },
    {
        "date": "2014-10-23",
        "rating": "5.0",
        "review": "The sausage I had was great. The fries were amazing and they have a great selection of beers. Will definitely recommend and go back."
    },
    {
        "date": "2014-10-23",
        "rating": "5.0",
        "review": "Ever had a rattlesnake hot dog? No? Well then go to Wurstküche and get your fix. I love this place and need to go more often. All the dogs are phenomenal, from rabbit to the alligator, and the beer and sauce/topping selections are impressive too!"
    },
    {
        "date": "2013-07-17",
        "rating": "5.0",
        "review": "It's rare to find a restaurant that has as a sausage selection as diverse as their beer selection, but Wurstküche delivers on both fronts. Once you've managed to find parking, have located the correct entrance, navigated yourself to the back of the line, and sent a scout ahead to the dining room to stake out your spot (seriously, do all these things), it's difficult to make a bad choice.Of their many sausages, I've tried several:Bratwurst: Sweet, mild, subtly spicy, and very user-friendly.Hot Italian: Snappy casing, hot and juicy, everything Johnsonville would want it to be.Austin Blues: Perfect southern smoked pork sausage, with just enough heat. I actually don't think it's as spicy as the Italian, but I've never had them at the same time.Marharlika: Such a lovely combination of super-sweet pork, mild spices, super-juiciness. Almost like a high-quality Lil' Smokie. Delightful.Alligator Andouille: Good flavor, but pretty dry and crumbly and a very thick casing. Definitely get with toppings or some sort of accompanying condiment or sauce.Duck and Bacon: I didn't know what to expect with this one, but it was also slightly crumbly in texture. Relatively mild in flavor, I don't think I would have identified either duck or bacon, but it was still quite good.All of their sausages are grilled to perfection and placed lovingly upon a likewise grilled, soft bun that will both yield willingly to your teeth and hold all that shit together. I don't personally get toppings, but they offer grilled peppers, onions, and kraut. In the dining room are bottles of ketchup and all four of the major mustard groups (yellow, dijon, whole grain, something else -- mustard is not my condiment). I also encourage you to experiment with their many sauce offerings such as curry ketchup and blue cheese bacon walnut.I also hope you're a fries person, and even if you are not (and I'm actually not!), you have to try them. These are the best fries in LA -- thick-cut, perfectly fried, slightly crispy, tender, and not too greasy. You can easily share small fries between two people, so I recommend doing so and trying as many sauces as possible alongside.Lastly, if you're into beer, Wurstküche offers a stunning selection of German and Belgian beers both on tap and in bottles, including La Chouffe, Blanche de Bruxelles, and pints (!) of Spaten.Before Wurstküche, I wasn't really the sort of person who would recommend going to a restaurant that exclusively serves sausage, fries and beer. Now, I can't really imagine the Arts District, or my life, without it."
    },
    {
        "date": "2014-11-08",
        "rating": "5.0",
        "review": "Well... Where to start? Beer? Juicy sausages? Double fried fries? The obviously genius combination of meats? No its wurstkuche and it is just flippin fantastic! The mango jalapeno is so juicy and while some may shy away from the size it is really filling! You get like 6 kinds of mustard! 6! Whats not to like?"
    }
]